[{"savoureux": ["", "good", "", "", "", "", "good", "", "", "", "very good test", "", "", "", "", "overall\nthe portion size\nthe quality\nwas good\nalso the food was cooked according to the cooking instruction.", "nice", "king in town.", "maida is not backed. it's not in proper form. it's liquid . so it is not eatable. please take care for next time", "All time favourite restaurant", "", "", "", "nice 👍 🙂", "", "", "You spoiled the experience with wrong thai curry.", "Excellent", "no spoon included, how they expect us to eat??", "", "", "every time I ordered from this restaurant food is great but today all food were worst", "", "very good 👍", "", "Just Wwwooooowwww", "very quick n fast delivery by zomato", "unhygienic food, there was hair in food. very poor quality packaging,service and unhygienic food.\nordered food after checking 4 ⭐ but the quality was worst.", "", "all time best", "loving it", "quality 5/5\nquantity 4/5", "", "good", "", "good", "", "according to price taste was not good.chinese bhel tatse taste is sweet.\nim not happy", "", "very good", "thanks", "Dal fry quantities must be increased !! choice of sabji needs to include in this fix dish.", "", "it's always a joy ordering from here and enjoying the tasty treats", "garlic naan was awesome but can be a still more spiced up", "", "dono Paneer Ki Sbji Bola tha Par Veg Sbaji Thi.", "", "", "good", "", "Keep It Going....", "", "", "chaas taste was not good .", "the experience this time was not at all good with the food...please ensure better quality and taste next time", "Keep It Going...", "", "Perfect Quantity & Authentic Palak Paneer", "Food was okay .", "", "Keep It Going...", "supper fast delivery", "", "The taste was good keep it maintain for future orders but u need to work on your Dal fry & Dal tadka for the thickness", "Was tasty", "taste was good...but manchurian ball should be a bit more soft with some more dry gravy...seemed to be very dry.", "", "👉 Dall Fray 3rd Class Quality\n👉 Food Quantity Very Low Rate Very High\n👉Corn Tikki 3rd Class Quality & No Green Chutney\n👉 Very Bed Food Regular Customer savoureux", "", "I can't t see any butter. it seems Paratha has been prepared long back", "good", "Good service", "I had ordered without chilly it was full of chilly", "Not tasting good", "", "", "nice and co operative delivery man", "", "", "", "the roti should of aata and not maida", "", "", "", "nice food", "", "", "food is very good", "wrong order delivered", "", "No cutlery was sent. Difficult to eat with bare hands in the office.", "Good food testy.", "There was a gravel and soil part in my food, while I was eating it. Horrible experience, did not eat food.", "quality less food...", "", "Worst food ever, manchurian was too hard, wonton was ok, chinese bhel was bland as hell, please avoid it at any cost, i won't rate it higher than 1/5", "It wasn't having any taste. Just bland mix of things.", "spoon and napkin missing\npacking should be improved", "", "thank you", "Wrong item delivered and also I have add instructions not to make spicy sabji and they have made spicy sabji.", "we are appreciate with excellent food Savoreux", "good", "not good", "Kya kar raha hai bhai", "", "less spicy and too much oily and heavy paneer stuffed.", "", "good taste and on time delivery", "I have added few delivery instructions which restaurant has followed and prepared the food accordingly.", "very good", "more pasta and no cheese not baked properly.overall no taste at all", "", "Delivery boy has delivered the parcel before time. Appreciate that!!", "same gravy for both sabji... not suitable...", "I'm Happy", "", "", "", "", "I ordered this soup frequently..but this time taste is not so good..", "", "", "very nice", "", "nice one", "Vary bad taste of sabji", "very nice", "", "excellent meal option if you are in Ahmedabad. great taste and nice quantity. well worth it", "absolutely no taste in food with so small quantity", "bad packing...soup was licking in bag..", "", "totally non spicy food... order instructions not followed", "", "Had ordered (3) Butter Parathas, Dum Aloo Kashmiri and Kashmiri Pulao. They were served with onion slices, lemon slice and pickle. Quality and quantity of all food items were decent. Tastewise, the parathas were soft and Sabzi and Pulao were not overtly sweet. The food was delivered on time and was hot.\nThe packaging could be improved upon as the parathas were wrapped in aluminum foil, which was not sealed properly. However, other food items were properly sealed.\nFood: 👍🏼👍🏼👍🏼👍🏼👍🏼\nPackaging: 👍🏼👍🏼👍🏼\nVFM: 👍🏼👍🏼👍🏼👍🏼", "Just send cutlery with the order. I did not receive any spoon or fork. Else taste was awesome. Delicious food.", "", "", "always happy to get food that tastes amazing", "I have given order for jain and regualr dish is come", "", "", "", "good", "", "", "", "", "good", "", "", "", "Very nice food. It was delicious and very neatly packed. Taste Wise everything was very good especially tikkis were amazing. Quantity was more than enough according to price. Also as I ordered Jain it was pure Jain without any mistakes. Gulab jamun was so soft and tasty. At this price point this is the best pack lunch.", "", "Just Awesome", "", "nothing to add.. it's already awesome", "nice 👍", "", "Good healthy generous size soups - great value/taste!! Healthy stuff", "", "As I regularly order food from your restaurant, I love the food and the taste . But in today’s order I found a burnt matchstick. Please take it into the consideration and do not lose your prestigious name by not doing proper quality check. This review I am writing just to help you so that you can serve better to customers.", "", "", "average", "good taste, but it should be bit thik.", "", "Thank you for serving us with such delicacies. Everytime we order it's just turns up to be as tasty as before. Kudos to the Chef and the team working on it. You definitely serve Happiness on plater 😊", "Nice test", "good", "Really very noce food as recommended by zomato suggestions.", "good", "", "jain food order kiya tha\nonion wala bhej diya", "jain food order kiya tha\nonion wala bhej diya", "awesome experience 🤠", "", "taste is good but packing is not proper..oil was going out of the pack and other package is also destroy with this oil..", "", "Ordered Jain Paneer Chilly Dry but it was not Jain", "", "", "Food quality is super poor. This is first time I'm facing the issue. please take care of it", "will surely order next time", "", "good", "first time very bad experience", "", "garlic naan was very hard", "", "Overall food was amazing.", "", "", "sabji quantity was very very less", "", "I ordered thrice from here.. initially 2 times it was good. Today it was average food. but will try again. hope 4th time it turns out to be good :)", "Restaurants staff is very rude and not talk properly my food is west I complaint agains and he is (hotel staff) shouting on me. kindly provide delivery with proper instructions or not accept order if u fali to ans such kind of que like mine. I don't have any issue with test but how can I eat if my food is west my money is west .. poor service", "", "very nice", "didn't get full combo..", "", "everything is ok test....😍", "very good", "quick delivery", "Sry forgot about Zomato ,just a pic rest order was -Paneer angara- good one\n-Veg lollipop-good one\n-Masala papad\n-Hayedrabadi Biryani - I found low punch of salt but manageable.\n-Food is very affordable, not a date place in the eve, in the noon ,it stays quite mostly. Zomato pro doesn’t work there.", "first time bad experience", "cheating with me", "", "", "Shittiest hakka noodles I have ever had.", "it was pathetic, both things were not fresh, even panner was very bad so as the noodles, we have tried dine in two weeks before and that time that s items was very good, so i have ordered but very much disappointed 😞😞", "found insect ( mosquitoes ) in pineapple macaroni and stone in biryani .\nvery disappointed with this.", "coloured vegetable, very very poor packaging, sas", "Savourex has always been a restaurant of my choice with perfect food quality and decent quantity. It's value for money.", "Thai curry is not at all Thai … Thai curry has base of coconut milk and it’s totally missing … overall food experience below average.. Zomato must look at the star rating .. hope it’s not manipulated", "It is adequate for 2 person with normal diet. Taste was subtle.", "roti is very hard not good for eating n daal makhani was Lil bit spicy n soggy", "quantity of sabji is not enough.. half of empty bowl.", "Not sent sezwan chutney not good it's little sweet manchurian and nuddels", "Sabji other than paneer was not having a great taste. If the spice level was little bit more than it would have been amazing.", "nice food and very testy and fresh always be happy this food", "food awesome as always.\nwas tasty & have been ordering frkm here since 10 years", "Nice Food", "Both dishes are excellent. As expected as described. Loved to order next time for sure. Thanks.....", "we give special instructions not make spicy 🔥🔥...but it's too spicy 🥵🥵🔥🔥 and taste less...it's very very bad experience .. worst resturant and worst food...no one care about food instructions and quality...dan dump...😭😭", "Average food atleast give a spoon for gravy not satisfied", "Good Decent Food. Did not had color at all so Good Work but taste was OK. Not Bad not so amazing.", "chapati not as per given instructions, no test in Hyderabad biriyani just for plain pulaav only", "Food is really nice. Noodles can be better but its value for money.", "Very Nice And Tasty Soup..Love to see Jain Taste..", "Always the best in the food. Never disappoints. If you are fan of punjabi food definitely worth a try. Regular charges, reasonable cost, excellent packing and food quality.", "butter roti jali hui thi, dalmakhni spicy ti,\nDal fry me Paani bahut tha, bahot hi kharab experience raha aaj se apki hotel reject for me.\nso bad corn tikki me chutney nai .", "not taste at all as well as what I can saw in images is totally different from the product which I got.\nkindly improve it."]}, {"vishalla": ["", "", "", "", "", "", "", "", "", "", "Hum 11.12.22 ko dinner ke liye gaye. 3002 rs diye. 1rs ka humme discount diya aur bola ki 1rs ka aapko discount diya h. Delhi se main ahmedabad aayi thi apni beti ko milane aur hamne dinner ka program banaya vishalla m .per khana itna kharab tha 1001rs m hamme sabzi mile aloo patta gobhi kala chana aur undhiya sabhi ka taste local dhaba se bhi gaya gujra tha agar aap log jana wale ho to aap soach samjh kar jana ranveer Brar ne jitni tarif Kari uska to wo 10 percent bhi nahi tha pls sab soach samjh kar jaiye ho sake to meri hard money h agar refund karva sake to that will me lot thanks.", "", "", "", "", "", "", "Came here for lunch. They charge 500 per person for a thali with only 2 items and paranthas. Very average food. Overly priced", "", "", "", "", "", "One of the oldest restaurant of Ahmedabad. This restaurant is Ahmedabad's heritage. This restaurant has to be in a must visit place for every traveller visiting Ahmedabad. The restaurant is amazing and is a great place for all age groups. Lot of things for the children to roam around and play around. Also there is a Utensil Museum, whic is one of a kind with largest collection of precious utensils. Restaurant offers seating spaces on the floor as well as on tables. Puppet show, traditional music are other attractions of the restaurant. Ample amount of space for parking your vehicles. Highly recommended!", "Refund money paid for Dudhi na Muthia", "", "", "Need to know how much GST charged in my billing.", "", "I am thankful to my colleague for throwing a party at Vishalla. It is village theme based restaurant with puppet show and folk dance organised for the guests. Ambience is so beautiful and atmosphere in here is soothing and relaxed. It is one of the best place in Ahmedabad for authentic Gujarati food. All the dishes are delectable and worth every penny. Staff is super active and courteous. Vishalla becomes all the more alluring in the night with lanterns. A must visit place with family and friends for a lovely dining experience.", "", "The restaurant has a waiting area with average performances in the form of music and dance. We bid our time…close to approx 1 hour just dozing off and then after following up with the waiter multiple times he called us out and we followed him to the dining area only for one mustached individual who I assume is the maître d to shoo us off like we are some destitutes telling us come after 15 minutes…horrible…it’s been close to 30 minutes since as I still write this review…questioning my self esteem just as much as the horrible service at this place", "", "", "", "Dudhi muthiya not delivered…\nBoth dishes are dhokla", "", "", "Do not depend on them ! You will be disappointed! Just imagine you are craving for what they can deliver and than they don’t respond !", "Beautiful place, very homely vibes and food also good.\nAbsolutely justifies the 623 price for thali.", "", "The place is very awesome we enjoyed live music,puppet show,museum, ample seating area, no parking issues n also in the visahalla’s best thing is greenaries…❤️one of my best place ever", "", "Handvo ordered was delivered in time but quality of handvo was not upto the mark for the reason it was prepared before few hours hence was too cool , Vishala should had given the idea so that customer should think before ordering", "The food was very bad quality and oily. Also the service was not good. The food was salty. I will not visit again", "Vishala is a village themed restaurant. It is just like a mini village which comprises of a cow shed, hens, charpai seating area and the staff in traditional outfits.\n\nThe water is served in kullad.\n\nThe staff is very polite and would serve you with a smile.\n\nWe went there for lunch but to our disappointment their famous wide spread thali was available only for Dinner and instead we settled for a set meal thali.\n\nThe taste was still very good. It comprised of Aalo gravy, Turi ki sabji, Dal, Muthiya, Puri, Paratha, Jalebi, Salad, Rice, Chaas and IceCream\n\nThe mosquitoes were a bit annoying for which the restaurant should take some measures\n\nOverall a good and unique experience.", "This place use to associated with identity of the Ahmedabad. On recent visit, I found it does not stand to his name. Be is hospitality or food — it lacks both.\n\nBeing foodie and lover of Gujarati thali, I have visited most restaurants that serves Gujarati/Rajasthani thali but Vishala’s food suppose stands not much to merits. Very disappointed or may be I expected much more. Yes good thing is that they stick to Gujarati food and not chat, South Indian, punjabi etc.\n\nIf nothing, I enjoy kadhi khichadi or dal rice but here khichadi was not that I liked much.\n\nHospitality was not that bring any attention much too or service. Not bad but does not stand to its price.", "We ordered handvo and it was cold as if taken out from the refrigerator...\n\nDisappointing...", "Visited there after hearing lots of good things about this place. Really loved the food and staffs were very polite. You get a whole different vibe here, felt so relaxed. Must visit place. Saw so many celebrities visiting this place, now I know why.. thumbs up to variety of foods and polite staffs..", "", "", "Quality of food is average, not like before\nNOTE:- None of the staff members are wearing mask, they have just hanged then under their nose!\nAvoid going to such dinning spaces in this pandemic\nSome were wearing gloves while serving and some where not.!", "", "This is heaven in Ahmedabad. A calm soothing place where one can spend hours, sitting on the village style charpaai, sipping hot pudina tea from kullad (earthen cup) enjoying the breeze.\n\nThey also have full thalis and have puppet, traditional dance shows while having dinner but I am yet to have that.", "", "", "A must visit restaurant if you’re in Ahmedabad. This place gives you the whole experience of authentic rural food. The food is finger licking good!! The vibe of the place is a plus, it makes you feel like you’re in a real rural setting. That being said, the place is neat and hygienic overall. Great service and professional staff.", "I visited this place many times almost once a two month and want to share my amazing experience with you all\n.\n.\nTalking about the ambience they have the best ambience, but the best time to visit this place is at night for dinner. This is the perfect place for lunch and dinner with your family and friends with some authentic Gujarati food\n.\n.\nThe entry is just amazing and then there is a puppet show, traditional Rajasthani folk dance along with the mocktails. They have the julas and there is a museum as well which has all the traditional things stored\n.\n.\nThen for dinning it has lower seating with leaf dish and bowl and they serve delicious authentic food and the menu is changed every...read more", "Vishalla is know for its village theme restaurant. Actually, you would feel like a restaurant, it’s a small village by itself 😅 With amazingly delicious Gujarati thaali, the puppet show and traditional Rajasthani dance has its own charm ! 👍🏻 If any of your friends or relatives are coming from outside Gujarat, do take them to this place 😍 Everyone deserves to have this beautiful experience!", "", "Went to this place 3-4 days back (on the day of Dhuleti) after a period of 10 years. We did not find hospitality as we felt on previous visits. The food menu is not worth to the price they charge. The service was extremely poor. Nuisance of mosquito is major problem. Even after charging 700 Rs./person, ice cream and kharek are single serve. Zomato gold is accepted only during breakfast", "", "it was an amazing experience at vishala.\none should atleast visit place once\nfood was good\nthey have proper gujrati thali\nit was so yum\ni loved the live mohanthal.\n\nfood - 5/5\nprice :- 2/5\nquality :- 5/5\nambiance :- 5/5", "It was an awesome experience. We were recommend that this place was a MUST and it really is.", "", "Great food and great ambiance i will visit every time i come to Ahmedabad", "Its an amazing place if you love Gujarat food. Unlimited dinner was very tasty and good. It was good place to spend time with family and friends.", "", "", "Staff is rude at the reception, the food is below average. The staff is uncourteous and there is always some sort of chaos at the reception, could be streamlined. We were a group of 20+ people.", "", "A place like Vishalla is always visited with high expectations. I made a visit after many years and I was surprised to notice that they have really hiked up the rates and the experience is just not worth it. First of all, the hospitality is no more warm and comforting. They were not in a Welcoming Mode. It was literally a weekday with normal crowd and yet the staff had hard time serving. The guy in complete white outfit who is there at each section was specifically arrogant enough to even know what we needed in our plates. Secondly the food taste has 100% changed. The signature dish Khichdi Kadhi was very ordinary. On a winter eve when village theme restaurant serves lukewarm food with...read more", "#AnEveningWellSpent\n#FamilyDinner\n\nThere is no need for mentioning the menu as picture says it all.\n\nSpecial mention for atmosphere, service and the vibes 😍🔥.\n\nJalebi and Dalwada steals the show.\n\nThis is the place whose food is not that heavy on stomach as other places which serves such kind of food gives you uncomfortable feeling in the stomach after grabbing such spread 😀.\n\n#ChildhoodMemoriesReloaded", "", "", "We are frequently going to vishala and happy to praise about food but this time we experience worst\nAll food items are not up to the mark\nThepla are uncooked, butter was not fresh , dhokla was not tasty smelling vierd, all vegs are not having proper Gujarati taste , and above all service for serving food was full of waiting\nWe were very much disappointed\nI must add is this our proud gujrati thali ???!!!!", "", "Went on our visit to Ahmedabad and was highly recommended.  Ambience is good, but did not find the food worth the high price being  quoted.  There were many items but most memorable was the dhokla and chass only.  Teplas was very dry .", "Vishalla has been an iconic place for village theme. One should visit this place while a visit to Ahmedabad.\n\nAn attractive entrance, ambience with dim lights and kerosene lamp, pathway of sand and swings with Indian sitting. It was a wonderful experience. There were puppet show and folk dance too.\n\nFood was really good. Each item was at its best taste even if it is the simplest.", "Too expensive for the food, can visit once for the ambience and theme", "Must visit place. Village theme place with delicious foods.", "Vishalla:The Godfather Of Thalis!\nAmbience:A complete village-look and feel with burning of neem leaves to ward of evil and mosquitos\nThey have a section with a choice of sitting on table and chair,or one can opt sitting on the floor cross-legged with low tables.Very traditional indian style seating\nBefore starting ur meal one cleans their hand with dry ash then warm water is poured by the attendant.Unique!\nFood:They have an assortment of sorts which arrives.Fried green chillies,boiled mungphalli,boiled katols,limewedges,pickle,beetroot wedges,cucumber slices,tomatoes,gratedpapayu,greenchutney,jaggery.This is to start u up served with outstanding chaas which is perfect in this weather\nThe...read more", "I went with zomato gold, but they said they offer it only in breakfast. Unfortunately I this information i could find and went with a thought that vishalla is an zomato gold place", "One of the finest restaurants that we visited in Ahmedabad. It is is a village themed restaurant where there is no AC. You have to literally eat like the villagers, squatting down and eating with your bare hands.\nThey have puppet shows, Rajasthani folk dance shows and folk music being played throughout the property. The utensil museum is adjacent to the vishala restaurant and is accompanied by a shelter for cows, ducks and other pet animals. Many celebrities including the likes of PM Narendra Modi, Baba Ramdev and many more have visited this restaurant. You can have unlimited food here since they give Thalis. You have to have your food on a plate made out of leaves. Foods will come one by...read more", "Vishalla is a village themed, Lantern Lit, Rural Fantasy in Ahmedabad which will take you through a Gujarati food paradise.\nI had the poori shaak plate which had:\n1. Tomato, potato, and green peas Sabzi\n2. Five pooris\n3. Green mirchi fry\n4. Salad\n5. Papad\n6. Pickle (my favorite of the lot)\n7. Chaas (buttermilk)\n\nThe ambience is lovely! You sit on cots and dine the traditional way.\nThere's a Gujarati thali in the menu too.\n\nWorth the bucks you spend.\n\nA total delight.", "Vishala is one of the old favourites and popular restaurants when it comes to Gujarati food here in Ahmedabad. Food served in traditional leaves plates, sitting on the floor and food cooked in traditional sigri makes the dining experience here worth every penny. Whenever in doubt, you can always rely on this place for a good experience. The theme represents a village setup. Priced for approx 600, the place offers a traditional Gujarati thali with ample dishes on the menu. One can also opt for and Ala carte menu (In a dedicated seating area). The food which is Cooked by traditional means surely adds up to the taste. The guests are also treated with traditional music, dance and various...read more", "One of the best restaurants in the town serving traditional Gujarati food. When you step into Vishalla, the thing that promptly grabs the immersion of your eyes is the rural ambience. The restaurant has a vibe of it’s own and has an authentic feel to it. The food is served here on natural thaal leaves and the sitting is on wooden katha and mattresses. When you venture into Vishalla, a warm gesture with nimbu soda would surely refresh you. Apart from food, you can also enjoy traditional Rajasthani folk performances, puppet dance and much more. You surely can’t miss Jalebi, sukhadi and chai.", "It's a village themed restaurant. Ambience is quite good according to the theme. Mainly Gujarati Thali is served. I really liked the food. Service is also good.\n\nDo try sukhadi and Chai. ( Not together ofcourse 😅)\n\nAlso I did like Jalebi and Laddo.\n\nThe place is very spacious.", "Nature and all are good but as compare to rate...food quality is not much. worth sweet only. Test is not good, not preferable form next time", "Cost effective food with Indian traditional serving and atmosphere. Great experience and refreshing. Food is hygenic and delicious. Its venue also contains one small museum with old utensils and other vintage things. There is small magic show and a grand garden for children", "Pure and authentic Gujarati food’s search has only one destination is Vishala. Amazing village theme ambiance. Snacks were hygienic and delicious. Must try Jalebi and Sukhadi. They always make everything fresh with extra love. The only thing I would like to suggest that please keep at least one person as an attender. Everything was up to mark. Costly but worth it. Tea is heaven for Chai lovers.\nDinner and lunch are also delicious. Check out some pics to get an idea.", "Best ambiance of village theme restaurant enjoy your food in pie and authentic village style. It serves best Gujarati cuisine with best service. There are a lot of activities to enjoy at Vishal’s so take minimum 2 to 3 hours time to enjoy the facility of Vishala.", "It is pure authentic place.\nThey use tree leaf to serve food on.\nIt is amazing ambience as well as great interior.\nAs it is a restaurant but this much authentic place with amazing food", "We went to Vishalla after a bit of research as to where exactly we get authentic Gujarati food. What struck me was that it had typical rustic charm much like that of Chokidhani near Jaipur.\nWe were amazed and awed by the experience as we were ushered in. One objection I have is that they do not provide choice to the customers as the only option available for sitting inside was thali and not other items given on the menu.\nSo we did opt for thalis. Inside, many local art and culture were on display including the Rajasthani folk dance - Kalbelia. They’ve done well to maintain the rustic settings. Once we sat down, it was overwhelming range of dishes which included the typical Gujarati...read more", "We are here to celebrate my nephew's birthday.\n\nBeen here with full family all of us enjoyed well here\n\nFood is good as well and we young people found it good and authentic\n\nHowever my parents said \"its nothing special and charging too much\"\n\nBut you can have this experience once in your life."]}, {"tomatos": ["Best hotpot rice in Ahmedabad", "", "pizza strips were very bad. thai curry was bitter", "Amazing", "All Time Favourite Dish Yummy n Super Se Upper", "Best hotpot rice in Ahmedabad", "", "pizza strips were very bad. thai curry was bitter", "Amazing", "All Time Favourite Dish Yummy n Super Se Upper", "", "", "Arrogant staff. Especially the order taker.\n\nDisrespectful, a regular customer but not visiting anymore,will prefer to visit some other place with courteous staff", "", "too spicy and theres oregano on it which i dont like.", "", "", "i ask for cutlery but they didn't send", "ordered Genoa bowl got veg pasta instead!", "unbearable extremely spicy. Couldn't eat.", "Unhappy. Too late expensive. Did not like taste.", "", "", "preparation time was very high", "quantity was very less and in the name of exotic,it has got latus only. rest was apple cucumber Indian capcicum and lots of vinegar. really disappointed ☹️", "The Best Mutton Biryani you can have in Ahmedabad. Tomatoes never disappoints..when it comes serving the best tasting food with great service and sufficient quantity. My favorite restaurant in Ahmedabad. ♥️♥️", "", "highly disappointed", "", "", "I had their brownie with icecream at the sizzles festival in Ellisbridge Gymkhana. It was awful. The brownie was dry and the nuts were bitter. The staff attitude was really bad too. Avoid this place and it's awful food.", "", "No tissue paper, no cutlery", "", "stale and smelly food.. not worth the money and not at all 5*", "Taste and quality is not the same.", "", "", "", "", "worst experience with tomatoes restaurant. poor restaurant management.", "", "", "Could have been spicier", "Bad experience", "It’s Okay", "", "The taste is gradually getting degraded", "", "No cutlery when I specifically wrote to send cutlery", "", "lal singh good ex plane non veg food .. well manage valuable time .... fast and perfect service", "satisfactory", "we have informed for Cutlery at the time of order but it's repeatedly not been added by restaurants. either there should not be an option or they should sent compulsory.", "", "", "", "", "Good service by alam and mik with delicious food.\nGreat infrastructure.", "second time they sent me the wrong dish!", "horrible package, spilled mojito", "", "", "", "Ask the restaurant to mention clearly when the dish contains only mix vegetables especially full of carrots which is not used as vegetable in Gujarat😡", "", "After placing & calling to mention Jain order u gave regular !", "poor packaging", "", "Ordered veg dish paneer Tikka masala and got a non veg dish after 1 hour. Folks be careful...check what you order before eating. Tomato's and Zomato are both pathetic", "Horrible papad like kulcha,never order it😡", "It’s not Mutton Rogan Josh okay", "All Time Favourite but Today Hot Pot Not Hot 🥲", "", "donot expect this quality of food from tomatos .. not at all satisfied", "", "", "", "best Cheeese naan in town", "They sent ice cream with the apple pie and it had all melted. Should have been packed separately", "Never ordering from here again", "", "", "Delivered after 93 mins, not displaying the exact timings on screen for delivery is the real concern. real time is not real", "Never order from Tomato's on Sunday. They didn't send the ordinary onions & cucumber salad with the meal.Horrible😡", "Such a worst experience i had , i kept calling the restaurant to take my order but these rascals do not have the courtesy to either pick up the call or atleast call back.\nWORST EXPERIENCE EVER. Being a regular customer i had to face this issue. A big 0 to the management", "Fantastic", "", "Taste is awesome good ambience n overall nice place for dinning, staff behaviour was good, music was good n must visit when u r in ahmedabad…..😘😊😋", "All Time Favourite", "", "Fabulous", "", "superb food... thanks...", ""]}, {"dakshinayan": ["how we are supposed to eat the sambhar when you don't send a bowl or plates", "reqyested for no spicy\nstill continue giving ....\nsambhar was too much hot spicy.", "Doing good I have stayed loyal to Dakshinayan as they have consistent taste\nkeep it up", "so poor quality. bad taste", "", "how we are supposed to eat the sambhar when you don't send a bowl or plates", "reqyested for no spicy\nstill continue giving ....\nsambhar was too much hot spicy.", "Doing good I have stayed loyal to Dakshinayan as they have consistent taste\nkeep it up", "so poor quality. bad taste", "", "superb as per ordered", "X cellent", "Worst dosa ever. Street food cart sends better food than this. 2000 rs wasted.", "food was full of chillies.", "The PO packaging of the food was just terrible, totally unhygienic and unacceptable. For such a big order they did not offer proper hygiene in packing and as a result two of us who consumed have developed severe food poisoning! I will never order in future from the same restaurant again.", "", "vada not sent", "", "", "packaging was vary bed", "Please send hot liquids in better containers instead of plastic bags .\nIts not healthy for anyone.", "The dosa kheru had lots of salt that you can't even put one bite of dosa in your mouth. When I complained they were reluctant to even address the issue.", "", "", "Shocked to find hair in idli batter. Really careless and unhygienic.", "1. no cutlery\n2. not variety of chutneys\n3. inadequate packing.\n4. why taxes charged when the invoice shows ZERO taxes.\n5. very slow delivery", "", "over all good.\nshould improve packing.\nwhen u charging extra", "please improve your packing\nand avoid using stapler", "", "avoid using stapler pins", "", "", "", "The coffee was good but it was delivered to us in plastic bag not sure whether it is fit for consumption. 0 marks for packaging", "not good, ihad asked for mysor masala dosa n it was plain dosa arrived", "I have instructed give only sambhar with idali no other chatnis. You sent no sambhar and sent only green chatni. Please check before sending any order.", "Good place for south Indian vegetarian cuisine,comfortable seating,clean and hygienic,fast service ,courteous staff and tasty food.\nWe ordered Idli and spicy paper masala dosa,Idli was soft and fluffy,Dosa was perfectly crisp ,sambhar was tangy,different type of chutney served were good too.\nRecommended and will certainly return to try other items.", "", "absolutely 💯 awesome delicious taste", "", "", "", "", "very fast service", "", "", "The way it was packed was terrible. Third grade plastic pouch for Sambar and chutney, bad aluminium bowls for idli and bad quality foil for uttapam. Did not expect such bad packing ever!! And instead of JAIN Sambar regular with onion was sent so the food was incomplete. Never again!!", "Waste of money", "diffrence in quantity", "The dosa batter seemed to have expired, could not use it. It was of the worst quality.", "", "Sambar taste was very bad!", "food was good but packing is worst", "3 idlis pls", "", "Overall was not at all satisfactory, the worst part is the staff behaviour which can be better. Please don't take it as a complaint take it as a feedback.", "The quality of food and taste was okay.\nPrices are high.\nThe staff will disappear after providing your order. There is no one if you want anything else after your order and you have to wait for them.\nThere is a parking space in front of the restaurant but they don't allow you to park your car.\nIf you will park there, the staff and security guards will stop you and misbehave with you.", "dosa does not have masala... it's plane dosa", "salt was not present in the dosa. worst rava dosa", "", "Extremely poor quality", "", "", "", "taste was good. but quantity of chutney and sambar was low", "too high cost but good taste", "early deliverd", "Worst this lemon rice will not have lemon in it…", "They don't give proper things to serve food. Also they give sambhar in one beg.", "", "", "complete south indian taste", "They serve authentic south Indian cuisine at pocket-friendly prices. The service is prompt and the servers are friendly. Do try their masala dosas, mix uttapam, mini masala idli, rasam vada, neer masala dosa with molgapudi powder, paratha kurma and papad.", "", "", "", "chutney and sambhar absolutely watery so the overall experience was bad", "", "", "order was Jain and actually arrived was regular.", "should include rava dosa batter also", "Pls don’t send ordered things in polythene bag. Send it in proper container.", "Compare to other place prices are similar but less quantity.", "Typical south taste😋😋 in south Indian food I had experience after a soo long. Staff was well dressed with great gesture and they all know how to treat their customers with good service. Excellent 👌👌 so beautiful well dressed in south dressing touch. Impressive 👍\n\nOrdered mixed uttapam 💯💯, paneer dosa , Mysore masala dosa, meduwada, rawa masala dosa and yes idali😋😋😋 south dishes ho aur idli na khaye...it was so soft and good in taste.\n\nMeduwada was so so..but I think that was not for my taste buds otherwise it's best selling.\n\nOverall experience was super good and yes you guys are tummy fillers.\n\nService - 10/10\nQuality - 9/10\nVFM - 9/10\nOverall - 10/10...read more", "Perfect taste", "", "", "did not sens sambhar chutney", "Dosas from Dakshinayan is generally good.", "", "very bed quality and packing is very bed, red chutney is not delivered, wasted food and money in daxshinayan", "food is not good as Udupi paldi.", "", ""]}, {"gordhan-thaal": ["", "", "Bakvas dilvary", "", "The thalis that are sure to fill you up to the brim at a fair price. I wouldn't call any item in particular extraordinary, but the thali as a whole is definitely worth the shot, considering that every item is unlimited for a price of 350 bucks.", "", "", "Bakvas dilvary", "", "The thalis that are sure to fill you up to the brim at a fair price. I wouldn't call any item in particular extraordinary, but the thali as a whole is definitely worth the shot, considering that every item is unlimited for a price of 350 bucks.", "", "", "", "", "I hv paid more than Rs 275 and I am getting suki aloo sabji...we r getting test full food outside fix thali in just Rs 100....total waste of money", "Always the best!", "Leaked food received\nTotally unexpected. I want refund", "fine food and good service", "Portion was very less", "Too less quantity of rice. Disappointed", "", "good", "", "the food was very tasty and properly packed", "good", "Didnt receive my ordered quantity also no support from restaurant and Zomato", "Thank You.....", "", "papad missing", "Shak bhakhri sent instead of khichdi kadi", "Did not serve buttermilk with the food !", "Awesome and thank you!", "please curate the items else this concept will fold, which will be a pity.", "Really bad", "pls do better packing it can't be spilling food that can be delivered", "", "extra ordinary food as always", "quantity is reduced now but quality is same", "Picture and contents and quantity delivered don't match at all.", "order item missing", "All over not upto the mark if you take this much price not providing proper food packaging is not proper all spilled food 👎🏻👎🏻👎🏻👎🏻👎🏻", "good food", "Very good quality food, always.", "Excellent … only Papad was shattered and powdered and the Chutney of Tamarind had leaked out completely … otherwise absolutely excellent … loved it 😋😋😁", "", "Couldn’t not eat at this place. Arrived at 1:30 for lunch for 2 people. Long waiting line. Staff till 2pm kept replying, dekhte hai how much time it will take. After pushing the management, they said minimum 35 minutes. So Dekhte hai, if the management has anything to say to this review.", "", "Gordhan Thal! You’ve made my Diwali super Delicious!!! A very Happy Diwali to the wonderful staff of Gordhan Thal 🙏", "-------------------- Don't Go There Thaal--------------\n\nThe food quality has worsened significantly from my previous visit. Earlier, only outlets such as Atithi and Pakwan which served Gujarati thaals which were sweeter than sugar but Gordhan Thaal has joined the convoy now. Further, the interior needs a serious redesign as it is cramped. Staff is courteous and professional. Serving style needs to be improved as it feels like you are playing Temple Run. Prices are on the higher side with respect to the overall experience. My request to the management is to rethink how they see Gujarati cusine and explore the possibility of brining one pot meals or at least thali options on the menu.", "zomato last mile delivery should also be in lower temperature.", "food spilt", "", "dal jyada honi chahiye", "Parcel delivered without cutlery", "", "Food Was Cold..\nDisGusting .", "", "", "", "Ordered 500 grams of Gujarati dal as per menu but the quantity was just about 300 grams. This is not expected of Gordhan thal. Not done at all.", "Super delicious Papdi Chaat!!!", "Everything in this tiffin is all we want ... Ordered from last 2 days I would recommend you for sure. Go for it.", "Zomato is third class supplier,as time and delivery not match", "I was ordered 15 puri which is missing 😕 so how can i eat sabji without puri???\nthis is huge mistake 😠😠😠😠😠😡", "Taste was awesome! Just one suggestion. There should be options for Dal like sweet or punjabi or Tikhi and Thank you for cutlery!", "Quantity was good. everything was very sweet, even the paneer. it was like having desserts for food.", "", "", "Please explain any one..how to it this bakhri in Dinner !! i am really disappointed with Gordhan thal...\nAlso in photo they shows bhakri size is relly different ....", "", "Taste was good but was spicy for me", "", "excellent", "quantity is too less for the price", "", "oder very much late delivery", "", "", "", "", "excellent food", "Their ming dal halvo is the best. Jalebi is not preferred", "", "", "", "", "not happy", "Send Sweet though it is advised not to send !", "subji was sweet, I didn't liked it", "good rotis"]}, {"ninis-kitchen": ["today this dish pasta pesto is not fresh\nand not good in taste as well", "", "Curry few taste less", "There was no taste. Only routine toppings", "", "today this dish pasta pesto is not fresh\nand not good in taste as well", "", "Curry few taste less", "There was no taste. Only routine toppings", "", "", "", "", "", "", "", "", "", "Food was over salty", "Poor quality in stale food\nI was a big fan of Nini’s kitchen food, but today’s food quality was very Poor and stale food ❌❌❌❌❌", "", "item spilled not good packing", "Always the oil gets spilled. Please make some improvement for the dal packaging. Otherwise the taste is always top notch love it", "The pasta was very numb and garlic bread felt like stale\nThe chaas was only water no taste", "worst", "worst not at all worthy", "", "", "They have put onion and garlic even when I ordered Jain Swaminarayan food", "", "", "", "in fruit bowl i have not received any dressings..i have ordered twice and they have delivered blueberry and chocolate dressing..and today fruits were not fresh.", "", "", "order jain food nd delivery non jain salad,wnt full refund", "", "bad packaging", "Rider spilled the food and gave stupid excuses when asked", "Packets properly with love , you can feel that.", "Found it bit more spicy though, otherwise a lovely preparation as usual.", "", "food packet handed over to a wrong delivery partner initially and we got late delivery of our food", "", "Bad in taste not worth it", "", "there is hair in the chutney", "good", "loved it... superb food as always...❤", "", "there was no pasta or vegetable in the soup", "", "The pasta was very spicy but also sweet at the same time. The taste wasn't very good", "", "The curry was pathetic no spice was adduce to it. Total waste of money. I would request to refund the amount.", "", "", "", "", "", "", "Got the opportunity to visit this place for an office gathering, The food preparation was fabulous. The cheesy lasagna and mock-tails were tempting. The staff were welcoming and friendly. Great experience, Kudos to team Nini's. 👌", "", "", "Not worth the price.", "They are not following the cooking instruction.\n\nrepeatedly they are making some issues", "", "", "", "", "Worst pasta ever had", "Excellant", "", "", "very cold", "", "", "", "The price is too high compare to the taste.hot n sour soup was like okkk types.but peri peri paneer koftas tastes like shit.no salt no masalas.rotis was also burnt.n there was not enough butter in butter roti", "", "", "I have mentioned that don't use onion and garlic but you have used so it's waste ..", "", "The price is comparatively more with the quantity supplied. But overall the taste is good", "", "", "", "", "", ""]}, {"unlocked": ["", "", "", "Very tasty food …try each box of 1 …and u will never regret", "", "", "", "", "Very tasty food …try each box of 1 …and u will never regret", "", "", "", "", "", "", "", "It was so delicious I forgot to click photo", "the packing is wrost", "very tasty", "", "excellent .... delicious... quality standard is very high.", "it was spicy", "", "Why everything is spicy. I told less spicy still :(\nPlease take care next time", "", "Worst don’t worth it", "", "too much spicy and garlic", "", "Ordered a continental meal box and all of items were amazing. Taste and portion wise it was 5/5.\nDefinitely recommend it.", "excellent as always!", "", "", "A bit spicy but overall good taste and proportion", "", "", "good food", "Awesome", "", "", "", "", "great taste!", "taste is quite good, quantity is a bit less. 8 poppers are given in most of the restaurant now.", "", "", "", "You didn’t add chicken to the pasta, I paid extra 80 rupees", "", "They didn’t even inform or ask about service charge and billed. Upon provocation we are blamed that we didn’t deny !\n\nIs it our responsibility?\n\nRude and poor hospitality", "totally callous attitude...\nhopeless... Zomato is doing this so frequency...just lets these restaurants do this crap to customers whe", "", "", "Bad packing", "Packaging needs to be improved!", "Very rude staff, inhumane and disgusting way of treating people, management staff and the manager himself is very rude and pathetic.", "", "i ordered an indian meal box & the sabzi was completely stale, tasted sour & bad. Atleast don't send stale food for people to eat & spoil their health. Such a bad experience of this place. I would rate it negative if i could 👎🏼", "", "", "it was not good this time", "It doesn’t taste good with the dips", "it was over fried", "Food was horrible…. We have visited previously also ….. but this time food , service … everything was bad…..it spoilt a good Saturday evening for us", "", "", "I ordered mac and cheese and jalapeno poppers , chocolate mudpie and chilli quaridor rice , the packaging was very good and the food quality was yummy , according the price the quantity was superb", "", "", "Ordered dinner yesterday from unlock and the packaging was very nice and was leakage proof . We had mac and cheese which so good man you all should try and had chocolate mudpie which was pretty decent in taste . Try them out guys .", "Ordered spinach crepe and jalapeno poppers ,mexican mania pizza and the taste was just so good , love it guys you should definitely try it out .packaging was upto the mark .", "Italian meal box….amazing", "horrible food", "", "Yesterday i ordered steam chilli momos , jalapeno cheese poppers and mac and cheese from unlock and i was shocked to see the quality that they had . It was super tasty and yummy . one should definetely try.", "I ordered Mexican mania Pizza and Mac and cheese the packaging was good enough and the taste was up to the mark. Will order more in future from unlock😋", "please make packaging better", "So i visited unlock yesterday for lunch and it was super goood to be honest . I loved their belgium chocolate freakshake and rocky chilly quaridor. It was super yum and quantity was also sufficient as per the price .", "quantity is to low", "very yummy! keep it up.\nhope when I order again it will taste the same", "", "Unlocked is a jack-of-all-trades concept cafe. It has nice ambience, nice food, nice pricing with a lot of board games to try.\n\nIf you are an enthusiastic about the same, this is a great place for some quality time with friends. Food is delicious but not absolutely great so preferable when you want something not just for food but for a different experience.\n\nI tried:\n\n1. Jalapeno Cheese Poppers - Great\n2. Steamed Momos - Nice\n3. Italian Mama Mia Sizzler - Spaghetti was awesome...Macroni was nice 🙂\n4. Harissa Pizza - Nice", "", "I ordered yesterday macroni and cheese and mexican fiery pizza , i must say it was very cheesy and pizza also had a good spicy taste . Packaging was quite nice and had a good time enjoying the food .", "", "Ordered spinach crepes it was very good in taste and the the quantity was good enough , heavy for 1 person. looking forward to try more items from unlock✨", "This cafe haven’t items at first place before you order anything please check it out do they have items or not and also this cafe is not so good for ordering anything", "I want a refund", "The sofas and chair were untidy. There were so many stains I didn't feel like sitting on it. Cleanliness not at par", "The main thing I like here is their board games. I always had good times here with my friends having games and food.\nalways had good times here with my friends having games and food.\nYou can also play different board games enjoying the delicious food.\nwe tried\nLoaded Nachos with Jalapeno Ranch Beans\nLoaded Potato Skins\n7 Wonders of the Mediterranean Board\nItalian Farmers Pizza\nFiery Mexican Mania pizza\nChinese Manchurian Sizzler with Spring Rolls\nTortellini Pasta Stuffed with Fresh Cheese and Chermoula\nFully Loaded Belgium style Waffle\nBlueberry Cheesecake\nwatermelon aqua\ndeep blue sea\ndouble death by chocolate\nmint mojito", "@unlocked.in is one of the best cafe in Ahmedabad which I've visited.\nIt's a place with great ambience and amazing food 😋\nThey are also having a lot of board games to play while enjoying the food 😀\n.\nThese are some dishes which I liked the most😍\n.Steamed momos with hot garlic & sweet chilli sauce\n.Jalapeno cheese poppers \n.Mexican Mania Pizza\n.Macroni and cheese  \n.Rocky chilli quaridor\n.Nutella and marshmallow hot chocolate", "A perfect place to spend your time. The food is as appealing and delish as it looks. The ambience is something you are gonna love. Presentation of the items are so good that you'll definitely click pictures of it. The board games are cherry on top. The staff is very courteous as well. Do not miss out on this one !\nFollow @openlyinsane on Instagram and Facebook for more such reviews and recommendations !!", "", "I received the shake half, half was spoiled due to poor package.", "Good Quantity .. More than enough for one.. ✌️✌️"]}, {"yanki-sizzlerr": ["packaging was poor for Au gratin, it was spoiled in the baggage", "As always the food was awesome plus the service by Guddukumar and Dilipkumar was also great. I recommend it to everyone for the baked dishes too..", "", "", "Nice food and mocktail, with awesome service by guddu Kumar and Ajay kumar.....must visit place in ahemdabad", "packaging was poor for Au gratin, it was spoiled in the baggage", "As always the food was awesome plus the service by Guddukumar and Dilipkumar was also great. I recommend it to everyone for the baked dishes too..", "", "", "Nice food and mocktail, with awesome service by guddu Kumar and Ajay kumar.....must visit place in ahemdabad", "Yanki special sizzler is vesy delicious and tasty. Good service from guddu kumar and manishkumar.Also food quality is good.", "Best Sizzler Place to visit in Ahmedabad. If you have deep pockets and taste buds craving for sizzler this is the right place for you.\n\nThey know their product inside out, they handle the taste, quantity & service quite well.\n\nReally liked the skilled waiters who serves the Sizzler quite brilliantly.\n\nYou have to bare smoke if you want this world class cuisine in an Air conditioned restaurant.\n\nWe have ordered the Yanki Special Sizzler. It was worth the name, price could be bit lower as it costs around 1K.\n\nHighly recommend for Sizzler\n\nFood Taste - ⭐️⭐️⭐️⭐️⭐️\nQuantity - ⭐️⭐️⭐️⭐️⭐️\nAmbiance - ⭐️⭐️⭐️⭐️⭐️\nMenu & Offering -...read more", "Teste and services was very good ! Our server was Manish Kumar, he was very diligent and professional•", "", "", "So I had best experience. The veg club sizzler and the mocktail sofiyya was best.. I also liked red merry. But I loved more other 1. Guddu Kumar has assisted nicely.", "", "", "", "The food was exceptional and the quality was to the point. Our server Raghuvir was very friendly, truly enjoyed the ambiance out here.\nMust Visit.", "It's my third time here and we ordered a Cottage cheese Florentine Parmesana sizzler tonight. It was quite delicious but I personally would not order it again. No complaints, it's just not something I would go for again. Our server Harishankar was really amazing! Very attentive and polite!\nLove this place! Will visit again!", "Soup and sizzler was fantastic and services is awesome.. we love the taste 😋 Harishnkar and Ravinder are best in serving the food", "Very good service by all the staff\nSpecial mention to\nPankaj kumar\nRaghuvir\nAhmed\nVery amiable and chirpy staff. Great service👍🏻", "very poor service and tast", "", "Excellent food n service by pankajkumar....\nGud ambience n supporting staff hygienic food\nSoothing music n aquarium", "", "Excellent Sizzling Sizzlers by Mr. pankaj Kumar.\n\nWe ordered mock tails along with Mexican Nacho. Main item was Yanki Special Sizzler. it was amazing", "", "Had a great time . Pankaj kumar served us nicely and enjoyed hospitality and good food.overall nice experience", "The food here was really really amazing, must visit here once, ........Nice service by pankaj kumar...", "The food was too Damn good and the quantity was also was also very filling.\nPankaj Kumar had served as the food an adequate portion as well", "Waiter service was nice exceptionally pankaj was nice . It was a nice experience try one time atleast yanki sizzler special", "Nyc sarvis by pankaj kumar good addition good job by pankaj smart boy nyc seving good foood love it just got back yc playing with you", "Good service by pankaj kumar.Food served by him properly and interaction for the same is also appreciable.", "Great meal with good taste and good service. Specifically the manager who is managing the table reservation outside the restaurant is very welcoming and great in managing crowds. Happy experience overall!", "High price, poor quality avoid going. Better options of Restaurants. Poor customer support team. Base hot. Added stuff cold and not satisfied", "Amazing sizlers & mocktails, experience service, yanki special & vitamin c, orange twist, backed macaroni. Good music", "Food was really great. Definitely a worth place to try and eat sizzlers. The overall service and quality of food is definitely good.", "So, i and my friend visited this place for first time, but the chef who was working there, named mr.Pankaj wasnt a good treat to us, we ordered sizzler Yankis Special, after it been delivered, he came several times and keot on disturbing us, i wasn't going to POST this, but what was worst qas, he literally Took the plates , when there were last bites Remaining, he thiught, we were just doing timepass, like that was the Way Too Much Insult, i dont expect such treatment at such good place, and last but not least, he came to us for FOOD FEEDBACK, we said, it was good then he started insisting to post it on ZOMATO, and when we denied we dont use it, he was like, jhuthh kyu hi bol rhe ho aap...read more", "Delicious and tasty food.\nGood service by staff especially Mr. Pankaj Kumar. Also very Good ambiance experience.", "Awesome experience, well behave staff . Cheers!!\n\nGuddu Kumar & Bimalesh , best of luck !!\n\nBest place for visit !!", "Amazing food with great taste, would recommend to try peach Ice tea and Hot Brown Mushroom. Polite staff fast service. Thanks to Pankaj Kumar", "Food was good and yanki special is very good in test. Nice service by Pankaj kumar. Good place to go with family or friend", "Pankaj kumar is a very good person. His service was excellent. He was provided very good seating area to the family. Definitely we will visit this place next time", "Pankaj kumar is a very good person. His service was excellent. He was provided very good seating area to the family. Definitely we will visit this place next time", "", "Service is so good and even loved the place!!!!\nPankaj Kumar is so kind and Polite.\nFood is as always awesome.\nService is fast and they make the food as we suggest", "Excellent and quick service by mr Pankaj Kumar..I highly recommend this restaurant..Thanks for good hospitality", "I visited yanki sizzlerr nd nd pankaj kumar's service was too good nd nature nd all waf fabulous . Thank u", "", "Great taste of sizzler and mocktails , soup was one of the best time i tasted here , reccomend for every one to try it atleast once", "", "", "Excellent service and good qualityfood, pakaj Kumar and Ajay kumar provided hood service and have animates", "Services was too good and Pankaj kumar serve a very nice Services enjoy a lot ...nice food test is very good", "The services are excellent by Pankaj Kumar. very nice ambience and food quality is also good. it is over priced but can be visited once.", "", "Nice food but you have more options in nonveg too.. pankaj kumar is d best..good food good service must visit", "Good service ....compatible staff...pankaj kumar....good food......good interior.....nice aquarium.....good service....staff compatible", "Nice Food and Service. Ordered Yankis special sizzler and Chinatown along with minestrone and hot and sour soup.", "Very nice service by Mr. Pankaj Kumar\nGoooddddddddddddddddddddddddddddfdddddddddddddddddddddddddddddd", "Thanks to Pankaj kumar our experience was really good, service was fast, and ofcourse the sizzler were outstanding specially yanki special sizzler.", "Good service given by Pankaj Kumar . Must try Best Quality Food we lots of enjoy and atmosphere good 😊", "", "Amazing sizzlers. Great service. Nice ambience.\nHowever ventilation issue.\nService provided by us :-\nGuddukumar N. Harishankar.", "Nice service good quality of food and service(pankaj Nice service good quality of food and service(pankaj Nice service good quality of food and service(pankaj kumar)", "Very bad", "It was great experience,the food was great too and liked the service of Pankaj kumar, he suggested food items,which was great", "Amazing 🤩 food and very nice service good job smart look nice saving good attitude very smart boy thanks by pankaj kumar 💕", "Visited this place first time\nService 5/5\nFood : value for money 5/5\n\nYanki special sizzler’s\nRaspberry frost\nBlue sky\nGuava chilli\nCaesar salad\n\nEven feedback given was taken by them in positive manner\nOverall good experience", "We were served by Pankaj Kumar in an excellent manner with the food also being good having a wife variety of choices from Sizzlers.\nIts a must visit for someone who is into sizzlers.", "Good service by Mr Pankaj Kumar!!..amazing food..best ambience..proffessional behavior .\nIts really preferable to friends and family", "", "We have gone for lunch there on 23rd October at Yanki Sizzlers. The food, ambiance and service was very good. Upon finding the salad spicy, the staff ensured that the main course is prepared with less spice. I am grateful for their concern and especially Pankaj Kumar who inquired on regular basis for our comfort and preferences. Would definitely recommend for 2nd time visit.", "Awesome food & service by pankaj Kumar\nValet parking was also very good\nTaste of food was good\nIce tea was superb\nThank you yanki sizzler", "Best Restaurant In Town\nAmazing food & Service\nStaff excellent especially Ahmedbhai\nMocktails were also nice", "Very healthy and quality food with ambience and services up to the mark, specially Ajay and Guddu kumar", "Good Service, Pankaj Kumar. Food quality was good. Highly recommended place for everyone. Must visit in ahmedabad for sizzlers", "Excellent service by pankajkumar. Good attitude and good servicing knowledge. Hope next time he survew us again", "Service by Pankajkumar was great, very handy for the service of sizzler, with polite nature and nice gesture.", "", "", "Service by Mr. Pankajkumar was excellent. Lovely food served here. Must visit place for sizzler lovers. We visit this place often.", "Mr. Raja Singh and Mr. Guddu were attentive and polite. Food was delicious. Mocktails were the best. Good atmosphere, lights and seating.", "Food was very delicious !!!\nGreat taste and quality!\nExcellent service !!!\nMr.Pankaj was very attentive while serving the food !!", "Yanki sizzler c g road has vast varieties of sizzler available. We ordered Yanki special sizzler it was very nice , and Mr Pankaj has provided excellent service while dining out", "", "", "Tried blueberry infused mojitos and sizzling red chilli, veg club sizzler. Amazing food and great service by Mr. Pankaj Kumar.", "Ravioli is on top with sizzling flavours and great service @ pankaj kumar .. sizzler portion is also good and the drink is also good", "Excellent service by Mr. Pankaj Kumar , very decent nature , also the ambience and crowd was upto the mark.", "Good service and host by Mr pankaj kumar great food and suggestions by Mr pankaj kumar good mocktails as well", "Good food very good service 😃\nLove to come again with friends and family\nGudu kumar and basir thank you so much….\nHhhhhhhh", "Good\nFood and ambitious delicious and awesome great hospitality and great service specially from Mr pankaj kumar"]}, {"saffron": ["I need a refund", "", "U should atleast provide onion and papad salad if we have ordered so much", "We specifically told them we don’t want spicy food still they serve spicy as hell sabzi. Food quality is very low that i ended up infected with food poisoning next day! OVER ALL VERY BAD EXPERIENCE WITH THIS MUCH REPUTED FOOD CHAIN!", "Worst experience ever... never expected thus type of service and food from name like saffron.....\nNagetive rating", "I need a refund", "", "U should atleast provide onion and papad salad if we have ordered so much", "We specifically told them we don’t want spicy food still they serve spicy as hell sabzi. Food quality is very low that i ended up infected with food poisoning next day! OVER ALL VERY BAD EXPERIENCE WITH THIS MUCH REPUTED FOOD CHAIN!", "Worst experience ever... never expected thus type of service and food from name like saffron.....\nNagetive rating", "", "", "", "", "", "", "...actually we did not eat anything... worst ever! Spoiled our Sunday...!", "One of the best place to have an unlimited mela which is indeed bbq !\nStarters to main course and dessert!\nThey have some really tasty manchurian!\nThey have sizzler too which is yummy !\nThe main course is really tasty !\nThe food is really good in the rates which they have been providing !\nAmbience is good too !\nEnough for gathering of 40 people !\nStaff service was good !\nI really like their food and wants to RECOMMEND for its tasty bbq concept and a very pocket friendly place!\nI would like to HIGHLY RECOMMEND this place for everyone!", "Worst management and customer delight.\n\nWe went 8 people and wait for 15 mins for the table when 45 tables were vacant.\n\nManager want to attend only female customers and when we try to talk then he told “I am attending female customer. “ We waited for more than 15/20 minutes and at last said Manager not want to come and attend.", "Very bad response. Manager want to attend only female customers. We waited for more than 15/20 minutes and at last said Manager not want to come. Ruined our lunch experience.", "We visit this restaurant many times for unlimited dinner but it never disappointed us.\nAlways authentic taste....\nYou can try anything here...😊", "This restaurant is perfect for unlimited meals & a la carte as well. They have amazing unlimited meal at a very affordable price and is beautifully curated from soup to dessert that also contains barbecue on the table of paneer & potato, they have sizzlers & pineapple macaroni as well in the unlimited menu.\nIt is a worth going to place for all Ahmedbadi's.", "Recently visited @saffronbbqrestaurant (C.g Road, Ahmedabad).\nThis place has an amazing and royal ambience. The staff is welcoming and polite. The taste of the food is really very good and it was worth.\n.\nThe UNLIMITED Menu includes :-\n.\n2 Types of soups\n2 Types of barbeque\n2 Types of starters\nSizzler, Baked macroni\nwith pineapple\nSalad, Papad\n3 Types of sabji\n3 Typesypes of breads\nDal Tadka, Jeera Rice\nDessert of the day (Single Serve).\n.\nOverall it's a perfect dine-in restaurant that serves amazing Lunch/Dinner starting at Rs. 375/- only.\n.\n.\nFor more reviews / meets / collabs follow / dm @flavoursomes_.", "📍@saffronbbqrestaurant Ahmedabad comes with Amazing UNLIMITED MEAL at worth Rs. 385/- which includes following items.\n.\nSoup\nStarter\nSizzler\nBaked dish\nMain course\nDaal rice\nSalad\nPapad\nDessert\n.\nFood was so fresh and flavorful. Unlimited meal is best for throwing group parties and family gatherings. Must try.\n.", "Just loved this place and the unlimited sound here is a perfect meal including two soups , four Starters , one baked dish, unlimited barbeque on table, two North Indian main coarse, unlimited breads , dal fry and jeera rice, in desert they have brownie with ice cream. So much in affordable price. And the ambience is also very Soothing.", "perfect unlimited meal in just 375₹.food was fantastic. you can with family .ambience is good. in unlimited meal there are -Two Types of Soups\n-4 Types of Starters\ncrispy corn\nveg. manchurian dry\naachari paneer tikka\naloo chutney wala\n-Smoky Sizzlers\n-Baked Macaroni with Pineapple\n-Salad, Papad\n-Main course\n-Indian Breads\n-Dal & Rice\n-Dessert\nrecommended place .", "• A perfect place for unlimited meal.\n\n• Impressed by the quality of food which is hardly find in unlimited meal places.\n\n•The ambience and the staffs were too good.\n\n•You can spend good time with your family with delicious food.", "Staff's behavior is rude. They don't care about customer reviews.\nPlace was not clean at all. Food quality was not good.\nBad experience.", "I visited this place multiple times before covid... Always up to the mark.. But yesterday i visited it with my parents for the first time... I told them so many good things about this place.. But this place disappointed me yesterday... We ordered buffet.. And for the bbq they gave us cold paneer and aalloee thats it... It was not at all cooked... When we asked them to cook it... They bring the burned one.. All for sides burned... On top of that was not marinated... It was like having kaccha paneer with minimal taste.. Then they gave us main course.. Paneer, veg sabji and alloo methi... Withh big aalloo and min methi and no taste at all.. Main course all thik thak... Not that tasty... Dal...read more", "Taste of food was really disappointing. Must try extra sweet brownie with ice cream and pineapple bakedish. Few dishes were even promissing 100% diabetes guarantee.", "The best place to enjoy your unlimited lunch and dinner when you arebplanning North Indian cuisine. They have very elaborative menu. We went for the unlimited dinner option. They have two options for soup. In the starter segment, they offer two barbecue options (Paneer Tikka and Alloo). They also offer crispy corn basket. They also served Manchurian and Sizzler. Backed dish was also good. In the main course, there were three subjis and Roti/Nan. Jira rice and dal fry was also good in taste. In the end, they offer vanilla ice cream with brownie. Overall awesome experience.", "The Proportion Of Dal Makhni was less as compared to rice.", "Staff is very impolite. If there is something they don’t have, buffet in my case, be ready to be treated with least possible courtesy.\nWaiters and the manager are very rude and have no decency to talk.\nPoor hospitality. I know there is always a waiting line in front of the restaurant because of the food and price, but treating customers improperly is never a good idea.", "I visit with my family and there are the insects on d table and we dont complete d lunch still they charged full amount of lunch.and the main manager and staff manager both are so rude. Parking is not available", "Worst experience ever...\nNo taste according to the rates applied to dishes...\nCustomer is not served in proper manner.\nNot eligible even for one time taste.", "", "the taste was missing... had to had salt and lemon to make food eatable. this was disappointing...", "", "", "Not followed Instruction written\n\ni was ordered Pure jain food But lunch pack was regular .\n\n\ni need my refund otherwise will no need to continue with zomato.\n\ni am patron customer of you.", "", "", "", "", "", "", "", "", "", "", "Very bad service, not serving hot food, not good in taste even, too bad.. not satisfied with restaurant", "Ordered through Zomato, I will not order anything from Saffron now onwards.\n\nAll Naan, Paratha and Kulcha are over cooked and burnt from all side, on top of that the quality so bad that it’s not chewable at all.\n\nFor Paneer handi and Paneer Palak, both are leftover food, Paneer quality is pathetic.", "Tried unlimited. Not good", "Nice place..\nCourteous staff..\nTasty dishes..\nOvercrowded.. entry should be made booking based specially in this pandemic times", "Went with friends it was not my decision to visit however have to go as majority of us wanted,1.We reached around 8.45 the first thing they told that it will be closed at 10 we can understand it's covid situation we know all the rules so they should not blondely tell any customer like this,and if you are following the covid guildlines then why the social distancing between two table and chais was missing??? Staff were not wearing gloves while serving ??why?\nThis was the major reason that upset me\nAfter this the food and staff both were pathetic.\n2.It was unlimited meal,the papad was served burnt,soup was ok,Then the funniest things came that they mentioned it is veg lolipop and actually...read more", "This place is with nice ambiance, good quality food, but lacks taste for some of its dishes. Some dishes does not taste like they should. Overall its an ok place, worth a visit", "They offer unlimited lunch and dinner in which paneer Tikka and backed macaroni with pineapple are the two best dishes\nGreat place to have great food\nBut a bit expensive", "We have arranged a staff party for 50 people at saffron C.G road. When we went to meet them their attitude was very rude. Their manager told us that I will allow you to come in only after all 50 will come. How come it's possible to reach at the same time. After that they have a very little space for parking. We requested them to park the cars inside the square so others will also be able to park at the place and our cars will not be taken away by towing wans. But due to their attitude they didn't allow us to park at their premises and one of our car which was parked outside was taken by the towing wan and had to pay 600 rs fine. Who is responsible for this?", "", "", "", "Amazing food love it totaly", "", "I went to this place with my friends. We ordered unlimited meals and that was my worst experience. I dine out every Sunday and this time what they did was unexpected. We were served food the was already prepared and IT WAS NOT AT ALL HOT. Sizzler is a dish that is supposed to be hot but the sizzler was cold. Taste was worst. Then came panner tikka which was NOT HOT AT ALL. They were not even considering our complaint seriously. DO NOT CONSIDER GOING FOR BUFFET.", "Taking all thing in mind this restaurant not a quality service and food too. The manager behavior is also not good. Don't visit this place. The food which is being is not proparly served.", "We visited Saffron for their unlimited lunch menu.\n\nIt had everything one can have in a lunch for a very reasonable price. The menu has varieties as well as it tastes good.\nStaff is courteous and polite but they do not have a parking space. Upon request they just shrug it saying manage it by yourself.", "I took my plate on my own because they are too busy.\nIn the peak time they stand above with finger bowl.\nWon't serve you half of the dishes.\nWon't serve you sizzler.\nAll over don't visit.", "Hey we have 4 people visited this place today for Unlimited Lunch...at initial it was not good seating they provide let's take it as secondary but the main point is About Food they are taking 350+tax for lunch it's not totally worth... No one will like to go again .. so as of in my mind the saffron is known for proper punjabi taste but this time it was the worst I have ever experienced... The Subji was tasteless nobody will take it One more time and In the Biryani was Also worst.. it's look like simple Yellow rice they have served without taste🤢... So If you plan to go...you can avoid. There are many good restaurants available which you can visit in same or less price Nd with good...read more", "Overall good for team dinner.\n\nBut need improvement in some of items.\n\nIt's better to not include some of items in menu If it's not good.\n\nKeep maintain each item perfect each time.\n\nOver keep improving", "This is a nice place for a group dinner or get-togather\nThemed place with so many design with a simple table for dinner.\nWe had buffet for a group of dozen of people.\nThe service was bit of slow and irregular but the taste overall was ok and good.\n375+gst for each thats bit affrodable by mass.\nCan try it once for sure.", "", "The overall experience was okay but the service provided was not justifying the name. Card Swiping machine was not accepting the payment via card. The staff needs to be reminded thrice to bring the next order. The waiters were following the correct instructions but the manager's couldn't direct them. The food in the buffet was missing the taste which you could get in al-a-carte. Do select al-a-carte option to get a good appetite.", "Staff behaviour was not acceptable as a very reputed Frenchie... Service is not up to the mark... Can consider below average... Reserved for family gathering... But disappointed with food and service...", "", "Saffron 😁 the famous for Indian food really are you guys served good food 😂 ohh please I went on Diwali night over there and that first impression we found hair in the glass and I tell the person who is taking the order that see there is a hair in your glass so he send me the new glass then he suggest us that try paneer chatakedar and from. The name I thought it was a spicy dish and I also tell him. That please make it spicy but the dish was pathetic and let me. Tell you we also find hair in panner 🤫 like guys seriously are you guys serving food or hair to the guest and then we saw the hair to the order taker he just take my plate and give me. The new plate no sorry nothing he...read more", "Had food in other branches of saffron. On festive it was over crowded. Khakhra was soft we complained but he said esa hi ayega madam.\nOverall food was good but service was slow.", "We booked for 25 people. But the manager asked one of the guests, that how many people are coming, he replied 20-22. So the restaurant cancelled one table of 4 and gave it to other customers & earned profit.\n\nBut four of the hosts have to wait for some table to get empty & were forced to sit separately from the group.\n\nThe restaurant didn't even admitted their mistake. So whenever you go there also brief your guests about how many people are coming or else you will be highly dissatisfied & remain hungry waiting.", "", "Good food overall\nStarters was very good\nMain course was ok\nStaff was very polite and cleanliness properly maintained\nCould improve on there dessert by adding something diff to the menu.", "This place serves some mouth-watering and yummy unlimited food in the town since last 12 years(As per my knowledge and visit).\n\nThey have changed and added the varieties over the period of time.\n\nSoups:\nMinistrone\nMakai Da Sorba\n\nStarters:\nCrispy Corn\nSmokyz Sizzler\nCrispy Vegetable\nHaryali Paneer Tikka\nTandoori Aloo\n\nBaked Macaroni\n\nMain Course\nKadhai Paneer\nMix Veg Curry\nAloo Masala Dry\n\nEntire basket of assorted bread is available.\n\nAbsolute value for money deal no one can beat their taste and the price at they serve along with huge varieties.\n\nMust must visit place particularly this outlet only.", "Worst food ever. Tasteless and are only providing quantity against they are charging but no quality was there. Smoky sizzler were having no smoke and it were cold", "It’s a nice place to have lunch or dinner with family and friends. I find the place to be little pricy but it’s ok. Food is good though. Ambience is also nice. Staffs are good and friendly.", "Well food was ok ok. But the service is pathetic. We found hair in the food 😒😖. Double check the review before visiting here. Well I personally don't suggest any one to go here.", "Old restaurant serving tasty north indian foods for years.\n\nFood quality and taste is above average but not that much extra ordinary.\n\nThey even give option for unlimited meal too.", "Saffron is known for its healthy food quality but its thing about past. As I found an insect in my plate here still the manager Mr Balaram Rathod didn’t want to accept it and he chew it carelessly in front of me arguing that was paper and not an insect and still not accepting.zomato ask for minimum 1 star but saffron is actually less than 0 star beware guys to have your feast here.", "Found an insect in my plate here still the manager Mr Balaram Rathod didn’t want to accept it and he chew it carelessly in front of me arguing that was paper and not an insect and still not accepting.zomato ask for minimum 1 star but saffron is actually less than 0 star beware guys to have your feast here.", "I have been there and the food quality was good and staff was less responsive. Please improve your services. Location is too good for people to easily reach there.", "The restaurant denied for gold benefits. They told me that we have no further tie ups with zomato. If there is a concern between you and The restaurant then why customer would have suffer?", "All good like service food and thanxx Zomato for gold benefit ..sizzler was to good.i m enjoying food with Zomato gold membership and its partners food.", "I have to really say, That this is the best food experience I ever had in my life! I and my friends went their for hangout dinner... And the food was mind blowing. Quantity was extra large and I can't describe the deliciousness of food in words. Best quality, Best taste, Good service and excellent quantity. Actually worth a visit😋😋😋😋😋😋😋", "One of oldest restaurant in Ahmedabad. Food is good. Staff is polite. Not too good ambiance. Need some improvement in cutlery. Parking is issue there.", "Visited here for a Sunday Lunch with Friends. Actually the Food & Service were good. But with Saffron we Expect something moreeeeee. It was all standard and boring, like any other multi-cuisine restaurant. On the food Side- Lassi Shot was something unique and the same being limited; It was something to comeback here for. On the other hand Potato Roasties and Baked Macroni + Pineapple was totally inedible. The same could be ignored because the menu is big enough to try other items.", "One of the best in navrangpura. The service provided by the restaurant is good. Food quality and taste is good. I often visit as its nearby my residence.", "Awsome taste and service. I have been in saffron many times. Paradise for starter and paneer taste. Taste is always consistent, also coming up with new idea and surprise.", "Very nice atmosphere , very testy food , and loved tandoori food. Specially paneer tikka , it was great experience , and very friendly staff"]}, {"toritos": ["we ordered Maxican Quesadillas, Burrito Bowl but it was too much oiled maida roti & pulav with beans. Not at all satisfied with food. Quality was not up to the mark.", "", "good food", "", "Open dining was good but flies were abound. Hummus and pita were not at all good for the price point. Hummus did not taste like hummus no favour of olive present. Their cheese pull out bread presented as their highlight is not at all good. Cajun potatoes were okayish.. Mexican casserole was rice.. nachos were average", "we ordered Maxican Quesadillas, Burrito Bowl but it was too much oiled maida roti & pulav with beans. Not at all satisfied with food. Quality was not up to the mark.", "", "good food", "", "Open dining was good but flies were abound. Hummus and pita were not at all good for the price point. Hummus did not taste like hummus no favour of olive present. Their cheese pull out bread presented as their highlight is not at all good. Cajun potatoes were okayish.. Mexican casserole was rice.. nachos were average", "", "stop looting customer", "OVER RATED RESTAURANT.\nBELOW AVERAGE SERVICE\nDisappointing TASTE\nVERY NOISY AND SMALL PLACE.\nNOT RECOMMENDED", "", "The paneer is not at all soft.", "", "Not worth", "", "Taste was good but there was a smell in gravy which was off. Like it was stale.", "", "", "did not expect such poor and pathetic quality from this restaurant. if they charge handsomely, they should ensure that quality is maintained in each and every order.", "Excellent food in taste", "less quantity of pasta", "both the curry bowl and the rice was spilled in the varry bag..have got the refund but was a very bad experience and the valet was blaming your restaurant", "French style fondue tastes worst and over priced,,, so as the chocolate fondue and sizzler,,,, tasteless food and worst of the quality one can expect. Staff behaviour was good but food was bad,,,,", "The food was spicy", "Have visited this place many times and this place surprises me every time I go there with there food. The best dish that I like there and order every time I visit there is Mexican loaded rice. This is amazing dish and a must order dish trust me the quality and quantity both are value for money.\nDo visit this place.", "", "Excellent food", "", "Not proper packing cuntainer open so gravy put in bag", "The paneer was extremely chewy and that made it difficult to bite into. I understand home delivery might affect the food but this was really not expected from Toritos.", "", "Toritos is one of the oldest and most consistent Restaurant serving lip smacking Mexican - Italian dishes! It has been a crowd favourite for years now, food and service has been top notch always. The outlet is really simple and yet extremely elegant for a lovely food date.\n\nWhat we had\nMocktail\n1. Sangria Splitzer - A berry based refreshing drink ideal for the summers that are here in full swing.\n2. Traditional Mojito - Everybody’s favourite the classic refresher of all times, need I say more?!\n\nSoup\n1. Toritos Mexican - The traditional mexican flavours with nachos added to it for an extra element of crunch in the soup.\n2. Broccoli Almond - Creamy and flavourful, my personal...read more", "", "", "Looks like pani puri but taste worst.", "We ordered crispy ravioli and quesedilas. Ravioli was pathetic. It had stuffing of processed cheese and spinach.. tasted like tasteless, no flavour stuffed puri served with sweet ketchup Mayo. A restaurant that's charging so much money can atleast afford to put ricotta cheese in ravioli as it should be.\nQuesedilas were okay. It lacked flavour and again was stuffed with veggies and processed cheese. Fancy restaurants like Toritos shouldn't fool customer by using sub standard ingredients and charging high prices.\nWill try more dishes from here to judge the quality and taste in the future.", "Extremely Poor", "", "", "truly truly awful", "French Onion Soup needs correction. Pizza had way too much cheese. Lasagna seemed a little off and very very sour.\n\nThe Hummus Pita and Chimichurri were excellent!", "worst experience. Toritos was never this... I think they've lost the taste. I'll never ever ask anything from toritos... Total waste of money", "There were tiny stones in the rice i ordered and not just one i came across two three stones while chewing my food. It was not acceptable. Horrible quality i have come across for the very first time in from toritos", "rate is super crazy...... quality is just fine.... many others in business giving same dish with better quality at less price", "No mushrooms, no jalepinos, no corn.\n\nThey didnt give farm to forest at all", "I have had this dish when I visited the restaurant for the first time. It was amazing! But today I ordered it and I was highly disappointed. the gravy taste was amazing. But the rice serving seemed to be less and the cottage cheese was not all cooked. I had to remove them. I don't recommend this dish for takeaway.", "The taste was fantastic, but the quantity was less than the previous time I had ordered.", "Enchiladas were too salty. Could hardly even eat them.", "The food is not same as it is received usually the dish is only different instead of cottage cheese it is kind of risotto very bad experiences", "so bad in taste , no cheese and no crispiness at all , newer order again", "Food is good. Service is also faster . Pasta is very tasty . It has good variety in starter and main course", "", "Worst packaging. All the food was spilled in the bag. Please use good quality containers you are already charging enough to provide better containers.", "", "", "Perfect place for Mexican Italian food lovers.. Main course variety is good.\n1. Tuscany Squares must try.\n2. 'Toritos' Mexican soup must try if you like bit sour taste\n3. Baked Lasagne also very good in taste\n4. Baked Macroni with PA. Was not much sweet so I really liked it. Perfect taste.\n5. Sizzling Chimichanga. Tangy sause taste is just wow. Rice is awesome. Must try.", "", "", "", "", "", "", "", "", "", "", "", "", "", "Very very slow service! In time of night curfew taking 30 minutes to provide food after placing order is pathetic! Went fr d 1st time n maybe last time!", "Worst restaurant experience!\nWaited for 2 hours and still didn't get served.\nMeanwhile 6 deliveries were served while were ordered after we ordered\nPathetic service and pathetic taste\nWhen we reordered soup which was finally served they just added salt and water and gave us the remaining...\nNever ever go to this restaurant even of it is the last available.", "", "Amazing food with great quality. Love the chimichuri cottage steak, along with khao suey soup. One of the most authentic places.", "The Enchilladas were stale & gravy wasnkg fresh. They used pasta sheets instead of tortillas which means they don’t know how to make authentic enchilladas. Poor quality# worst taste# waste of money. Guys dont throw your money here, It will spoil your mood n money. 👎👎", "These people are fooling the customers. We ordered Tacos and Burrito bowl!\n\nThe Tacos had Beans sauce and little Salsa (which I couldn’t even feel) and cabbage. Thats it! Nothing more! It was bland!\nThe burrito bowl had the same Beans sauce on the top of rice and they had CURD! Are you kidding me?! They had CURD ON THE TOP OF A BURRITO BOWL! There were no sauces added. When I asked for Chipotle sauce those guys didn’t even knew what CHIPOTLE SAUCE WAS!? They gave Mayonnaise and Tomato ketchup mixed together! How the hell are they running a Mexican Restaurant I don’t even know.\n\nThere was a small joint named Twisted Mazzo, those guys made alot better food than these guys ever will!...read more", "", "", "", "", "Falafel wrap was undercooked and hard to chew. The falafel patty was undercooked and smelt of oil. The flat bread was oily. Taco salad was good.", "", "We love this place like anything. Favourite go to place. We never require to see the menu here its totally fixed always. Love the place forever ❤️", "This palace quite and clean. The side walls have illusion of mirrors.. staff is good and nicely responsive...\n\nNow the menu includes varieties of dishes with their ingredients.. nicely presented plate if you have love towards maxican food try this place..\n\nHere I ordered Grande nachos and Taco salad with cold drink .. here according to my taste I love this tacco salad perfect crunchy and tasty while grande nachos looks excellent but over cheesy. Both dishes are well presented. Quite costly and totally nice place for maxican food.", "This place is amazing if you love mexican food\nThey are one of the oldest in Mexicans food serving in ahmedabad I ordered taco salad and it was amazing! Overall ambience is awesome but could be improved as it was like something old interiors and needs an upgrade to it!\n\nSeating is quite comfortable and hassle free valet parking is also there so just visit the place to have some classic mexican food and have fun!", "", "Amazing and authentic food. Serve great Italian and Mexican cuisine. Loved the flavor of the creamy cilantro soup. Do try the thin crust pizza as well. We also tried the enchiladas and loved it. Overall the experience was good enough to make me write my first ever review.", "Review attached. Mat jao bhai, mat jao. Find another place. Bas yahan mat jao. Tell me, quesedilla is served with oil dripping wrap? Arranged liked a Frankie? I mean, cmon yaar. Tibbs Frankie me aya tha kya? Minus rating Hon chahiye for today's experience. Sorry Toritos, you were my favorite once.", "The place where I found Best Mexican unlimited buffet. I went with friends on dinner. Taste of food was good enough. Polite staff with best service. Ambeince didn't satisfy me. Otherwise Nice place for mexican n Italian food.", "Definitely on recommended place!!!\nTried\nHummus turki-5/5(quantity was very good)\nFarmer to forest pizza-5:5\nChefs special shashlik-3.5(the upar part was very thik)\nChimmichuri steak with rice-5/5(recommended plate)", "#fulloftaste #tooyumm #loveutoritos #maxican #fullofspice #cheese #funfood #daymaker #foodhaven #love #feelawesome #toritosdelisious 😋😋😋😋😋😋😋😋😋😛", "Definitely best place for Mexican food lovers. Nice place with proper dining arrangement. Ordered traditional mojito for drink and it was good. Lasagne and cornwich was amazing. Their food quality is great. Food quantity is enough for 3 person. Must recommend.", "As always the food is quiet tasty and delicious. The pizzas are amazing so give them a try. Visited for the third time. Nothing has changed but that's good. Ambience is very nice. In overall best place to dine in Ambavadi."]}, {"balista": ["food quantity is too less.\ntast is good, not extraordinary.", "didn't follow instructions", "Only Half cup cold coffe .", "very dry dish (rajma chawal)….it was more rice nd less rajma", "", "food quantity is too less.\ntast is good, not extraordinary.", "didn't follow instructions", "Only Half cup cold coffe .", "very dry dish (rajma chawal)….it was more rice nd less rajma", "", "", "Excellent place to vibe with friends and family. Food is also fantastic. Staff is so humble,polite and very cooperative. Must visit once will surely love it", "Big fan of wheat burger of balista 😋", "", "The whole order got cold by the time it was delivered and the location was only 4km away.", "", "Even though your locality is great, but pasta for this small amount for 280 is never acceptable my friend. The amount you served was not at all satisfying but yes sure the quality was good. Kindly look for the quantity for better customer satisfaction.", "just don't order\nworst !!!", "", "", "delivery was slight late", "pasta was little undercooked and gravy was less", "ORDER WAS GIVEN FOR MOJITO WITHOUT ICE , STILL I AM GETTING WITH ICE CUBES", "", "", "", "A great place which is pocket friendly and has great wraps & burgers. Loved the special burger and special wrap. Cold coffee was super strong and not that thick. Jamun shots were tangy and not that thick. Had a decent experience here.", "", "", "all three dishes were simply amazing, the packing, freshness of food. it was truly scrumptious fresh and felt like home made", "", "", "", "", "", "", "Amazing ambience with good varieties of food.\nIt's a cozy place to hangout with your buddies.\nPrices are affordable and taste is good.\nGood for healthy and hygiene food.\nWide range of burgers and pizza is served here.\nShakes and shots are providing satisfaction in beverages.\nBuy one get one free on burgers on Wednesday and wraps on Friday.\nIngredients are healthy and they use brown breads only to serve you healthy food.\nSeating arrangements are also spacious.\nYou can Order food through QR code.", "Absolutely waste of money.\nThe wraps were prepared in Bharkhri.\nExtremely thick outer layer, needs extra effort to chew.\nAll 4 wraps and the burger tasted same.\nThey put same patty in every item.", "", "", "Excellent restaurant and excellent taste", "", "", "", "", "", "", "", "", "", "", "", "Superb food and concept with amazing hospitality 👍🏼.\nWould definitely visit Balista again when i am back in Gujarat……..", "", "", "", "good", "", "was so spicy", "Fries are better than MCd And other restaurants\nThe best things is all the items are Wheat Flour #nomaida", "Very Good Food : And Specifically, It Serves HEALTHY FAST FOOD.\n\nAlso Its Very Pocket Friendly & Nice Ambiance.\nMust Visit.", "", "you will not get paneer in paneer sandwich and also not grilled bad taste not to order", "", "", "", "", "Loved the burger's especially that double decker's burger 😋 a must try place if you're craving for some delicious & yummy burger they are using whole weat bun of burger so that was healthier ❤️‍🩹. So what are you waiting for fam? GO & GRAB NOW YOUR FAVOURITE BURGER FROM BALISTA ❤️☺️", "Instructions are not getting followed I recently ordered desi paneer wrap and requested to make a jain preparation but they sent me non Jain food.", "", "always up for this pasta", "Layers Of Burger Says Everything!!! 🤩\n\nIn Frame 🖼 :- Balista Special Burger 🍔 & Paneer Tikka Pizza 🍕\n\nRating:- 4.5/5 (Yummy😋)\n\nAmbiance:- 5/5\n\n❌No Repost Without Permission ❌\n\n@thefoodstories_23 for more amazing food posts and stories. We post every food update of ahmedabad from the street food to the lavish restaurants, also we post home cooked food and it's recipes. Shower love & tell your family and friends about us.\n\n🔹️\n#thefoodstories23 #foodpics #balistaspecialburger #burger #favourite #food #bestburger #sbr #balistasindhubhavan #foodie #foodofindia #indianfood #deliciousfood #yummy #foodblogger #indianfoodblogger #foodiesofahmedabad\n#ahmedabadfood...read more", "Been here earlier this year with my friends. The food we ordered was not up to the mark or I can say the only thing that I liked here was the cold drink.\n\nTho the food was not great, but the staff their was kind and gave up our time to enjoy.", "So I have ordered about 4-5 times from here now.. my only go for burgers before was kfc zinger and after trying numerous other burger places I can proudly say I found a better replacement in ballista.. authentic taste.. good portion and lotttt of options! Try once you will love it..", "", "", "There is no cheese dip in my order and i call restaurant but phone is out of coverage area. What should i do", "A nice small burger place in Ahmedabad. I tried paneer schezwan burger, balista special wrap, paneer sandwich and mojito.\n\nPaneer schezwan burger was amazing, especially I liked it because it is a healthier replacement of a aloo patty.\n\nBalista special wrap was also a good healthy choice for me, as it was full of veggies and hummus. No unhealthy sauces.\n\nMint mojito was next level good to pair up with these yummzies. 😋", "", "After long time, I enjoyed good wraps. Good quality, tasty and worth spending. Reasonable enough. My favorite is Italian Garlic Wrap.\n\nMango shake was good.\n\nSee more on AKFOODSTOP", "Good burger and good stack of enough veggies. Patty was well cooked and not dampened in delivery", "it was too good 😍", "", "The food is delicious and mouth watering. Also it is fresh and hygienic. Must try pink pasta and Balista Sp. Burger.", "I visited this place with my friends for lunch and my experience was really good.\nThe ambiance is nice & they have focused on healthy options which is really good. The staff is well trained & hygiene level was maintained here.\n\nWe ordered ;\nJumbo Double decker Burger which was loaded with veggies, patties and cheese.yuummm\n\nPink sauce pasta was equally good , well cooked & saucy.\n\nSpicy paneer sandwich was my favourite, Homemade spicy sauce & paneer made the best combination in whole wheat bread. Highly recommended\n\njamun shots were so refreshing\n\nThey have many good combos as well & perfect place to relish food with family & friends.", "", "", "Great burgers with the buns made of wheat flour. Most recommended is jumbo burgers. It was tasting really nice and tasty being healthy .", "We ordered hummus burger, pink sauce pasta and corn cheese sandwich but everything was tasteless food. I am a big foodie and I mostly like everything but this was utter waste of money as well as time. NO DOUBT WHY IT WAS ALL EMPTY ON A SUNDAY PEAK TIME. I went there on a sunday at night and I was the first customer there.", "One of the best place for burger & wrap in Sindhubhavan....\n🍔\nAmbiance also good & service also good... many types of burgers available here\n🍔\nI tried some dishes...\n✅\nSpicy Club Burger\nJumbo double Decker Burger✅\n\nTikha Paneer Pizza\n\nPunjabi curry Paneer Wrap\nBalista Special Wrap ✅\n\nJamun shot\n\nPiri piri fires ✅\nSalt & Black pepper fries ✅\n\nPink Pasta ✅\n\nChikoo milk shake ✅\nMango milk Shake\n\nPaneer toasty\n🍔\nAll bread using wheat flour...\nVeg & Jain food available here,\nCombo offer on daily\nWednesday 1+1 Burger &\nFriday 1+1 Wrap\n🍔\n389 ₹ per person unlimited party (more then 12+ items)", "❣️ In Frame:- *Double decker Burger, Balista Special Burger & Schezwan Paneer Burger with wheat bun.\n\n❤️ Location :- 📍 @balista.ind (SBR) Times Square 2 sindhu bhawan road, sbr.\n\n❤️ Price :- 🔖Double Decker Burger :- 249 Rs.\n🔖Balista Special Burger :- 179 Rs\n🔖 Schezwan Paneer Burger :- 179 Rs.\n\n❤️ @balista.ind is serving wide range of burgers, wraps and pizzas with a healthy twist. Their buns, wraps are wheat based\n\n❤️ They also make in house hummus and chutney. I would definitely recommend this place to try their delicious burger.\n\n❤️ The best thing about balista is they only Veg Food and they serve Jain Food also.\n\n❤️ They have exciting offers...read more", "A perfect hangout place!\nRecently visited this amazing place in Ahmedabad which is in Bodakdev . This is literally the best place to hangout with your friends and family with amazing indoor seating area with great ambiance and food. They have got the yummy stuff to fulfill your taste buds.\nCafé menu have got burgers, pizzas , wraps, sandwiches and much more!\nAll the breads used the the pizza dough, sandwiches, burgers, wraps are made with wheat flour which is a very health option to try.\nWe tried:\n(1.) Pink pasta\n(2.) Balista special wrap\n(3.) Jamun shots\n(4.) Piri-piri French fries\n(5.) Punjabi Curry paneer wrap\n(6.) Rice bowl with paneer gravy\n(7.) Paneer club sandwich\n(8.) Basil...read more", "ambience is unique and amazing. they making healthy and delicious food. food was good. staff service are fast . owners are very decent. you can enjoy with friends nd family. also jain is available here. we tried\n\npink pasta\nFrench fries\njamun shot\npanjabi curry with paneer wrap.\nbalista special wrap\npaneer basil burger\njambo double decker burger\nrice bowl with paneer gravy\npaneer sandwich", "Recently visited this place. I found this place is best for indian version of healthy burgers and wraps. They are serving delicious food with a healthy touch. They also have different offers going on in weekdays you should definitely check.\n\nI have tried their double decker burger, balista special burger, pasta, tikha paneer pizza, peri peri fries, jamunshot, balista special wrap.\n\nFood was freshly made and tasty. Staff was courteous and friendly. Must visit this place for burgers and wraps.", ""]}, {"highland-park": ["", "", "subji is so sweet (it's good when little spicy).", "test is very low no test of food 🥹🥹🥹🥹", "", "", "", "subji is so sweet (it's good when little spicy).", "test is very low no test of food 🥹🥹🥹🥹", "", "worse opinion", "", "Nice", "", "", "", "", "", "some item is missing", "", "The temperature of the food", "", "", "packing not good", "very bad", "plain half cooked rice with no pulao taste and no vegetables added", "compare to biryani raita was not enough quantity", "", "", "good", "no panner in gervi and gema masla.bhuti jayda tha mediyam bolatha to vo nhi kiya bed sabji in hotel", "", "", "quality of food is not good.", "", "", "", "", "", "", "not good quality food", "", "", "tasty", "price is not justified for food quantity", "", "sabaji salad sweet all items are mixed", "3d class sabji\nnot be good food\nnext time, I am no buying your food..", "food was good", "Food was not packed properly, everything was mixed up, unexpected", "very nice quality keep it up", "🙏🌹👌👌👌👌👌👌👌😘", "it's yummy and not so spicy and hot to. thank you.", "", "", "", "Our full meal is so much nice and we love it. mouth freshener is also sweet and all things are warm and butter milk very cold. Thank you.", "Sorry to say but this time we aren't satisfied with the behavior of the delivery", "", "The worst food... please serve the fresh food...", "", "", "", "", "Very horrible taste of both the soups. Mushroom soup is sweet and corn soup have some Weird taste.", "", "good quality fresh food delivered hot.", "", "", "", "", "", "", "very good taste ..... and delivery boy is very humble", "", "", "", "food Was not prepared well rice was not cooked properly", "Packing quality is very bad", "Roti’s were half cooked .\nMissed to take pics", "", "overall good experience accept khoya kaju", "", "", "best meal", "", "it doesn't taste like birthday..it's just green rice", "", "Very bad experience today", "Not spicy, but good for daily dinner."]}, {"birmies": ["not giving onion & parcel was so damaged whole sabzi is spread in paratha & rice", "", "", "amazing food", "price is too high according to quantity", "not giving onion & parcel was so damaged whole sabzi is spread in paratha & rice", "", "", "amazing food", "price is too high according to quantity", "i already told for oil less. i think thay understood dubble oil.", "", "", "", "", "good food... must order if you like olives", "", "awesome quality", "delay in services", "the food was too cold & tasteless. garlic bread was so soggy & stretchy", "Totally wastage of money and time.\nThe paneer was so bitter in taste and olives were stale.\nNever recommended", "", "Very bad gravy paneer chilli only had 5 pieces which is not acceptable.", "", "", "quality of parathas are verry poor, they are half prepared. Be careful pls", "When you have already increased rates on zomato, why you charge taxes extra? And delivery charges are also high.", "In spite of showing free buttermilk on menu Birmies not deliver it since many times.", "Forget buttermilk", "In panner sabji they sent only pieces of paneer. Roti is not baked properly. Taste is not proper.", "", "", "Very bad Experiance of rest reception rude vehaviour", "", "", "The worst food . Quality less .", "", "Lately we have experienced that some of the Online Restaurants suppliers has detoriated their Home deliveres food quality. They think that someone who is ordering online is a desparate person and can be taken for granted.\n\nBut this may be due to the huge margin cuts Zomato deducts from their partners restaurant.\n\nSuggest instead that you may add your margin over and above the MRP like you are already doing with Sweet and Snacks partners.\nCharge upfront and make it transparent as nothing is free in this world.", "", "waste of money", "Food was good but onion smells very bad.", "Wrong order delivered\nAsked for matar paneer received matar aloo", "", "", "", "", "It was stale", "", "", "", "Onion taste is not good and its stinking.", "", "Small, cozy place to hangout.\nI ordered:\n1. Cottage cheese shalmargo:\nHerbed rice served with red gravy and paneer of Mexican flavour. Topped with cheese. Good quantity. 4/5\n2. Calzone: just like stuffed pizza ghughra. 😬 2.5/5\n3. Mexican burrito bowl: ok ok. Better go for the shalmargo. 3/5\n\nOverall ratings: 4/5\n👍👍", "", "", "", "", "we have unlock free buttermilk but not received", "VERY NICE FOOD AND PACKING GOOD 👌👌", "For people who don’t want spicy they should make accordingly but they don’t", "", "Not received butter milk", "", "Food was not hot as expected, so it was hard to eat the cheesy paratha. Overall food was testy.", "", "", "", "I didn’t receive my order and it is showing delivered", "", "", "delivery guy was very polite n on time", "", "really grt taste as if home made . please keep up the good work thanks", "", "", "", "", "", "loved it, yummy tummy full plate\nquality and quantity both up to the mark\nthanks Birmies and Zomato 😋☺️", "", "Well prepared tasty food", "I didn't got my Buttermilk :(", "it was very very spicy, I already gave the instructions to not make it spicy", "superb", "", "", "", "Very poor taste and very poor quality", "Just increase the quantity of daal", "", "", "", "", "", "Good Tasty Food always gonna order from birmies from now on."]}, {"jassi-de-parathe": ["The food and packing is very nice", "no 😊", "pricey", "good taste but quantity less as per price", "Jassi de parathe is the most hygienic and best delivery chain.\nI just love it.", "The food and packing is very nice", "no 😊", "pricey", "good taste but quantity less as per price", "Jassi de parathe is the most hygienic and best delivery chain.\nI just love it.", "food quality has gone from bad to worse. first they used to give amul butter but now they r giving some local brand", "", "", "", "", "", "", "", "", "Took extra time !!", "y", "", "one free gulabjamun is missing from the dish", "", "", "", "pathetic experience.", "very bitter in taste highly not recommended.", "I ordered with cheese they haven’t add any cheese in my paratha . Very bad. Frustrating bcoz I have paid extra for cheese.", "good parcel but salty food ,pulav was spicy ,not happy", "", "", "", "", "lovely darling", "", "", "hygienic packaging and delicious taste ever.", "🥰🥰🥰🥰🥰", "Worst experience ever. Couldn’t eat food at all. Had to throw it all.", "", "", "Not up to the mark.", "", "", "delivered person is not good", "", "", "", "", "Parotha siding is not cooked properly.", "", "", "", "", "", "", "", "Offered a free Gulab Jamun worth Rs. 100/- and didn't receive it. Never expected this from Jassi De Parathe.", "", "good food & speed Delivery", "", "", "sugar pack is not in parcel.", "", "Onion was not properly chopped, I found it might be used", "delicious", "spicy", "", "Love the packaging sent ♥️", "Excellent food all round", "The prahladnagar outlet is nothing compared to the vastrapur one.. the food is underwhelming at best.. the masala papad was tasteless.. the roti were a bit burned, the chhole was a mix of cooked and undercooked chickpeas.. the chhole gravy was just okay.. the only good thing was lacchha paratha.. the spoons weren’t clean.. neither were the plates.. unexpected for Jassi’s\nDisappointed ☹️", "", "", "Over rated place. Food was average. Nothing wow about All in one partha. Chole gravy was green(weird) and not tasty. Tomato soup was good and home made pickle.", "200rs ka ek pratha😂😂😂😂 tasty is average nd quantity is very less", "", "", "", "", "", "", "", "", "", "Very good packing. Good food.", "The food is inedible", "", "You are fraud. Giving 4 Gobi Paratha in one box", "Bad"]}, {"the-house-of-makeba": ["", "", "We booked surprise party for my uncle and we had really great food i must say. Also the hospitality was totally on Top. Must visit place for food and service", "", "Bhupendra and ranjit served us really good and the food , ambience was great.", "", "", "We booked surprise party for my uncle and we had really great food i must say. Also the hospitality was totally on Top. Must visit place for food and service", "", "Bhupendra and ranjit served us really good and the food , ambience was great.", "Service was five star ,the food was fabulous and the staff is very responsive and calm beaded bhupendra, Ranjeet,jyoti", "Food was so delicious and service also so good and fast and must visit this cafe, interior also so fine . Staff name : Bhupendra Ranjeet", "Good service and food. Amazing experience of fine dining.quality food and extra ordinary services.Bhupendra A", "", "", "I like the ambience , staff behavior and timeline service. However, the food was slightly on lower quality and was no that tasty. Kudos to Bhupender and Ranjit for good service.", "The food was delicious. & the service was amazing\nV good ambiance. Would definitely recommend others.\nBhupendra ,Ranjit ,Jyoti ,Rajat ,Anuj", "", "Great food with great ambiance!!! The service was timely !!! Staff were very polite and quick...the food was also great.... Bhupendra, Ranjit & Jyoti were really quick with the services... Highly Recommended", "The service of the restaurant is amazing, specially from Bhupendra and Jyoti.\nMocktails and pizza were great.", "Great ambience and tasty food . Very nice suggestion from staff for food ,,,,,,,, we loved the food and loved the service", "Excellent service. Our server Sagar was very attentive and professional. Amazing food & ambience. The chicken platter and rice bowls were delicious 😋", "", "", "", "The food was really good and the staff was really supportive and amazing as well. Bhupendra and Ranjit and Jyoti and Rajat.", "", "Very good service enjoyed the food great hot pot and pizza the serving staff was also amazing enjoyed the ambience as well Bhupender and Ranjit and Mahesh were great staff", "The taste of Thai curry is good but quantity is less and veggies inside r less", "", "", "The food totally worth the price and the staff were so kind to us the manage Mr Ranjit was also so helpful and kind and the staff members Jyoti and Shankara A big thanks to them.", "Arijit Singh,Jyoti and other full staff are really good and good was very delicious we loved it and staff's behaviour was too good we loved that", "Tandoori tikka and cheese butter masala was good and service was excellent by Bhupendra and sagar really appreciate it", "F&B guy Mr. sagar is very humble and nice liked the service..,\nwe orderd pizza pasta mojito and panini .\nhad great dinning experience", "", "Sagar helped us to find the best jain food options and we had amazing veg tax mex hot pot with Burmese khowsey soup", "The food is delicious and service was as batter then previous time. Overall the food presentation and taste was great. Thanks Jyoti and Bhupender for good Service.", "Food was very delicious and service of the staff was very cordial.. quality and staff is very polite and efficient specially anuj . Niranjan", "The food was amazing\nAnd the service was mindblowing\nI suggest everyone to visit this place once\n\nBhupendra and rajat and ranjit", "joyti bhupendra and ranjit were fantastic tonight. There and the restaurants service was very good and the food was also good", "The service was really very quick. Bhupendra & Ranjit & Shankar were on their toes to serve us and make our experience memorable. The food was so delightful and tasty. Definitely recommend this place.", "I love the food and service Mr.niranjan is very nice and cares my table thank you all makeba team.food was very tasty", "Very Delicious food with good price … Nice place for Hangout with Friends n family… Recommend ..Norgel,sagar , sachina n Ratan", "Excellent service. Food is great. Jyoti and Bhupendra, Amit were very attentive and quick inthe service.", "Food nd Services are Awesome..\nThey Make Jain Food Vary Delicious..\nNorgen nd Sagar nd Sachin are Doing Friendly Behaviour With All Customers.", "", "The food is very good both continental and Indian cuisine. The service and the staff is very good. Bhupendra, ranjeet and amit and joti have given us good service through out the dinner.", "Good services and ambiance\n\nAlso you can enjoy delicious food here with indoor/outdoor facilities\n\nBhupendra and ranjeet and amit and jyoti", "Food is amazing we loved it,\nAnd all staff members are very friendly and supportive\nThank you so much\nWe enjoyed the place ☺️\nBhupendra, Ranjeet & Prem", "", "Very good food and service. Mr bhupendra, Amit,Jyoti and Rajat were very attentive and provided very good service.", "", "Amazing service and staff. Loved the food, especially Khau suey. Special thanks to waiting staff Bhupendra, Jyoti and Amit", "The service was good the food tasted excellent thanks for the service the house of makeba-bhupendra and rajat and amit", "Food was very delicious and service of the staff was very cordial… the place maintain the highest standards of quality and staff is very polite and efficiënt specially Bhupendra , Amit and Sachina", "Very nice ambience, food quality, service. Place to visit multiple times. Green Thai curry was really good must try once\nAmit", "Awesome food and lovely hospitality by the staff.. Ambience is 5 star.. Mr. Ranjit Singh provided great service🤩🤩", "Hygienic delicious food. Helpful and polite staff. We ordered raj kachori which was really good and also paneer toofani was delicious.\nBhupendra and devnath were very cooperative.", "The food was good and the service was also good. Bhupendra and devnath and Sankar were attentive to us during the meal served", "Best food in Ahmedabad for sure. The goto place for non veg lovers. All dishes are amazing. They have a lot of cuisines and justify them too. My favorite is dynamite chicken . We were served by Rajat and Bhupendra, although we reached the hotel at 10 pm they were very courteous and the service was excellent. Would 100 percent recommend this place to everyone.", "Food is really delicious. Staff is really frank & polite Specifically Mr. bhupendra, Rajat & prem. Service a too good and fast. Must try dessert - MAKEBA SUNDAE WAFFLE.", "Food was really nice both veg and non-veg along with the timely service. The staff was very helpful and polite especially Bhupendra and Amit.", "The food and service both were very good. Love the ambience too. Thanks to Mr. Bhupendra , Shankar and Amit for the great service.", "", "", "Loved the food and the hospitality. The food was very tasty and everyone provided the best hospitality.", "Food is fabulous and ambiance of site is also different,,must visit place,, behaviour of staff is also good aspecially bhupendra,Amit ,Shankar, rajat and prem when you visit with small kidos", "Highly recommended, good food and ambience is very good. Bhupendra, Amit and Shankar wew serving us and they were very helpful and handy. Thanks to them for a great dining experience", "The service and ambience of the restaurant is good. Food tastes comparatively good. Highly recommended", "We tried Pahadi Paneer Tikka and Alfredo Pasta with Chilli Guava and Nutella Shake. The taste and service was amazing and worth every bug spent.\n\nBhupendra and Amit have been great with the service.", "Classic Mazze platter is a must try!!! Also the staff is very courteous and helpful specially Bhupendra and Amit..", "", "The food was very good and the service was excellent. We were assisted by bhupendra and Amit. Both did a very good job.", "The food was delicious and the service was good. The service was fast and the taste was according to our xpectation. Bhupendra and Amit", "Food is very tasty and also nice service. It was awesome day with friends and also view of the hotel. Bhupendra ,Amit and Rajat", "Great ambiance with different themes at each level\nSukur ali Moiz is table captain who served us very well.\nGreat human", "The ambience is superb and its a really happening place to have dinner with your partner. Good service provided by Sukur Ali, Mahesh and Niranjan. Thank you guys 😊", "Mexican Platter was so tasty (must try 👍), Mocktail are tasty as well.\nover all tasty is excellent.\n\n.\nName - Norzen (Servicing is good + Asthetic vibes )", "Akash from makeba served us well also and he was available continuously which I really liked , excellent food, ambience everything", "Had a blast here with good food and good service. Recommend for all cuisines. Fun to dine and even hangout with friends and family.\nServiced by bhupender and amit and niranjan.", "I try the red sangaria🍸 seriously guys it's really good...and love the food and fast service.. ambiance was awesome..👌... thanks team of the house of makeba...Norgen,Anuj, Joyti and Ankit", "Amazing view.. fast service thank to the team of the House of makeba.. love the food and ambiance hospitals... Thanks to anuj and Norgen, Ankit.. gave a good service..,,🙂🙂😋", "The food was really good also the service was very fast. Special thanks to Bhupendra, amit and niranjan for the great service.", "All staff was amazing and the food was briliant the ambience of the place was very nice and the service provided was also amazing Amit Deves Shankar", "We had dinner overhere celebrated brothers wedding anniversary and we had a great experience and service from team and especially from Bhupendra amd nirnjan was there to help us..", "Amazing food very delicious and the service is just outstanding bhepndra and Amit and ranjan and mahesh", "Food was good,great service and exemplary ambience, go to place italian cuisine bhupender ,devnath and Rajat", "The ambience was very fabulous...the service and food was amazing...\nWe enjoyed\nService by Bhupendra and devnath", "This is the 2nd visit to this place.\nDecided to visit again basis our 1st visit’s experience\nThe food is really good, each dish has its unique taste unlike many of the places\nService was really quick. Thanks to Bhupendra, Amit, Ranjeet\nRecommended"]}, {"taco-bell": ["", "Please check with the orders while the restaurant send because I ordered cheesy nacho but instead received normal nachos", "", "", "I most love rice bowl , specially the veggies which is fresh and appearance is mouthwatering. Packaging is perfect with proper quantity condiment.", "", "Please check with the orders while the restaurant send because I ordered cheesy nacho but instead received normal nachos", "", "", "I most love rice bowl , specially the veggies which is fresh and appearance is mouthwatering. Packaging is perfect with proper quantity condiment.", "I loved tacobell food , specially burito and crunchy tacoes . And also taste of churros bomb is very much creamy from inside .", "", "It usually has cheese & chicken stuffing buy it came with just chicken stuffing", "cinnamon Twist r not good otherwise it was good", "was good, fries were good, do not order cinnamon twister... rest all fresh n good", "there was no taco in the plattwr", "", "Taste was Good but you are not giving Sufficient Hot Sauce for 6 item only 5 Sauce Pouch For that main reason I disappointed", "I had ordered from mobile app & i called 5 times in 50mins & they rider not available & very rude behaviour", "", "the quantity was not enough as per the he order", "Good taste....", "Taco base are awesome", "", "what I said\nusa taco bell is batter then you", "No sauces are provided with so many items , sauces are more popular thn tacos if you know", "food was not fresh", "No sauces sent", "", "they had put different sauce than usual", "Fries and nachos packets were not packed or taped. The quantity was very less.", "", "", "", "", "actually me mene bola b hai instruction me k mko fire sauce jyada Dene k liye par mko nahi Diya hai 1 b nahi diya", "Quantity was very less.", "WILL NEVER ORDER FROM HERE AGAIN! THEY DIDN'T ANSWER ENDLESS CALLS! NEITHER DID THEY PREPARE FOOD ON TIME! THE DELIVERY AGENT WAS WAITING FOR OVER 45 MINUTES!", "", "taco bell and Zomato make fool people", "If you’re eating anything from TB, you have to have their sauces fire, hot etc. Without ‘em, food wouldn’t be that tasty. I explicitly wrote to put extra pouches of fire and hot but unfortunately I literally didn’t receive at all. Called ‘em, but call didn’t get picked up.", "", "", "", "only 4 order came instead of 5", "", "The taco shell was soggy and there was no ranch sauce on it. The Mexican fries were also totally soggy and not crisp. The burrito was ok. Have been regularly eating from Taco Bell and was always happy but today’s experience was a big let down", "", "", "I had paid 696.95, whereas I received bill of rs. 650 with order. clarify and re credit balance amount to me", "They forgot my pepsi in that combo bad service", "", "amazing", "", "", "", "", "Take too much time for preparation and receive cold wrap.", "", "", "", "", "The potion size was very small.", "Though I ordered burrito bowl without onion and garlic i received it with onions. clearly they don't see the cooking instructions. worst service. i would have given minus", "", "", "Didn’t send extra fire sauce as per instructions", "food was not good", "it was not crunchy, instead it was feeling like a bread", "", "", "worst delivery service", "", "", "wrong order send by tako ball", "", "Not good", "all the wraps and tacos had become soggy", "pls improve tast", "Regularly delays orders.", "", "My instructions werent followed", "better packing in rain would be appreciated", "overall good churros is very nice & i have quarry about iskcon cross road outlet is not available in Zomato and swaggy", "packaging is not good", "Tried tacos for the 1st time in India and it was up to my expectations.", "", "please don't order taco bell online....", "", "got only 1 taco when i had ordered two and there was no burrito bowl too", "too much rice in some burritos. reduce the quantity of rice", "the restaurant didn't follow my instructions. I had simply asked them to put more hot sauce and no ketchup or fire source. instead they just added 1 fire sauce and 2 ketchup and no hot sauce.", "", "", ""]}, {"starbucks-coffee": ["poor packaging, whole office became dirty", ".", "It was not that good which i was expecting from Starbucks", "My allover experience is very good at starbucks but this time very bad or worst", "Very bad", "poor packaging, whole office became dirty", ".", "It was not that good which i was expecting from Starbucks", "My allover experience is very good at starbucks but this time very bad or worst", "Very bad", "", "I requested to write the message on order and I personally called them too still no message on coffee flask", "I had ordered no sugar , it is filled with sugar", "", "Absolutely awful.. never using Starbucks ever again. Very poor coffee. Use a local business! Not these..", "Perfect coffee!", "how can you completely forgot to put sugar sachets with the coffee", "", "", "", "best hot chocolate 4ever", "", "I wish could 0. Starbucks doesnt give you a free cup to share coffee. They say buy another 350 plus coffee just for a cup seriously. Your staffs behaves as if we ask for something else. You dont give us a empty cup. I paid 700 approx for 2 coffees. You are overrated and Not recommended", "mza agya.", "", "packing was insane. didn't spill a drop.❤️", "", "", "didn't follow prior cooking instructions given through the app", "", "Second Zomato order for Starbucks but both time received wrong orders.\nInstead of hot beverage, I get delivered Frappuccinos.\nLast time, I went to pick the order and had to get it changed as they had made cold beverage instead of hot.\nToday’s order same thing happened.", "Your package will be liked and more than coffee liked", "", "", "", "Cheats with size. Happened twice.", "There was no ice added", "", "", "", "Less quantity and was not hot at all", "", "No instructions followed no one answered the phone", "they don't deliver straws with their drinks", "", "Worse packing worse taste", "Spilled coffee", "I already told do not add Whipped Cream. still it's in it", "", "Best", "", "", "", "", "Worst delivery and service, 2 items are missing and one received is of poor quality and found small insect. This is not expected from a reputed name.", "whole coffee was spilt", "", "", "", "These guys are pathetic in making coffee. They always add ice when I have always demanded no ice to be added. I've asked for almond milk and twice I have received coffee with normal milk.", "", "", "", "Super. Far better than navrangpura branch", "", "", "Never order from starbucks.", "As per the order brown sugar sachet was not added", "", "No sugar sachets provided. I had specifically asked for it.", "", "Delivery partner is bad in behaviour pathetic he is lying like he doesnt have a change and after he took out change. Pathetic your delivery boy", "", "High syrup quantity. very bad flavour. I have had this drink before. its not the same.", "", "The packing was pretty well done and met the starbucks standard. 2 stars just for the packing.", "", "Love the taste and their gestures too😍", "great taste. great packing\njust love starbucks", "", "", "Forgot to include the straw", "", "", "", "", "asked for something got something", "", "", "Delicious food"]}, {"mcdonalds": ["", "Worst experience of mac veggie burger", "", "worst experience ever", "", "", "Worst experience of mac veggie burger", "", "worst experience ever", "", "", "good", "", "", "", "Fries were very oily and not at all crispy. It was refried for sure. The puff was tasting bad. Bun of all the burgers wasn’t fresh.", "", "Horrible experience\nCheated us by sending disgusting burger", "", "Ye ladka I am something he ladkiyo se gandi bate karta he or caste mer se bhi this parsan is not good and swiggi& zomato dilevry boy se bhi gali se bate karta he mcdonalds me eesa sttaf se vaster yahe a aana pasand nahi karte bad boy his work bad", "This is always our breakfast stop before heading home from vacation. Always delicious. Always great service. Always worth the stop.", "", "pathetic delivery took 52 mins for one burger n fries", "", "Food was not hot and not even fresh, bun of burger was dry and french fries was hard not chewable types", "Amazing", "No veggies in Mc Veggies burger", "", "items are missing in the order also not a single pouch of ketchup was sent..\n\nalso restaurant number constantly showing switch off when wanted to connect with respective person from the restaurant.", "", "", "", "", "very bad experience overall in the punctuality of food delivery. I personally visited the person who walked around from location and food is cold", "the patty was fully burnt this was unexpected😡 will rate 0/10 not acceptable at all.", "This is the second time mcdonals has given missing items but till charged me the full amount.", "I didn't get my order perfectly some items are missing I am really upset with McD and mainly with zomato", "It was not good", "", "", "dilevery partner very bad", "", "", "Cold food. Not acceptable", "", "its better you charge properly nd gv quality food nd maintain the status.\nthe specifically seems food adulteration.", "", "It was impossible to open the Fanta bottle. It was closed way to right and I had to throw it away.", "Good but fries were cold and soggy", "mujhe khud jaana pada lene kya ratings maang rahe ho aur peri peri bhi nahi diya", "", "Thank you for delivering the food so late night", "", "I want refund for this", "Very very bad food is so cold", "Not good", "Call me as soon as possible", "Fries are unsalted and fries are so cold", "we want refund.", "The delivery guy is really nice .He was polite and professional", "", "", "thank you for this amazing offer", "good", "Bad experience with staff", "It was all cold", "Skips 1-2 items from my meal", "", "poor packaging\nleake coffee from packet", "Worst ever old food packed and fries were refried", "", "", "as usual exceptional", "", "no souse", "Good service.", "good", "", "", "Good", "", "didn't send the cutlery and food was alsot ver well prepared", "rupiya nathi rakhto sathe cod ma", "", "The quality has gone down to a significant level. Was not satisfied at all!!", "", "", "I ordered maharaj burgers it's was amazing very good tast veg pettes was also super everything was good love it", "Need to prepare freshly baked things for night orders as well", "all good. but franch fry is not frash", "", "", "", "Juthe order de te hai", "please send as per the mentioned items"]}, {"burger-king": ["In my order all of the mentioned things were there except the crispy veg burger Truly a bad gesture from BK'S side", "didn't deliver the drink after I paid for it", "Great Delivery experience", "Not a great experience , quality and taste weren't good .", "", "In my order all of the mentioned things were there except the crispy veg burger Truly a bad gesture from BK'S side", "didn't deliver the drink after I paid for it", "Great Delivery experience", "Not a great experience , quality and taste weren't good .", "", "burger and fries were totally cold...and minimal mayonies were ther in burger...", "", "tnx jitendra bhai", "Bun quality is very poor", "very careless to the order", "", "", "stro is missing", "", "atleast don't be a cheap brand", "", "did not send the cutlery", "I order 2 burger and send me only one why that is not fair and very disappointing", "no straw was giver for coke", "", "want refund", "", "Not satisfied with chicken burger", "", "The tikki weren’t crunchy and quality of bun was not looking good.", "", "Good", "", "i am order to crispy veg warp but delivered to any burger 😠", "", "it is not hot so cold burger I am not happy to eat and not recommended anything to eat bargar king food", "", "", "very pathetic service by burger king they dont verify your order.\nthey send packages with 1 or 2 missing burgers to have heavy profit in online orders. this happened with me 3rd time. now onwards please don't choose burger king.", "", "this is not acceptable from burger king, this sticker is in my burger", "", "", "Bone was found in the burger. Very bad", "Very bed test and ved smell 🤬🤬🤬", "", "quality was not up to the level", "", "my order is mess ... burger is like .. they dipped in cold drink... disgusting... I want my money back... I want my all refund", "", "", "taste less burger 🍔 .... egg burger are taste less..", "", "No ketchup was goven fries were not fresh and fries potato was bad and stinking", "", "", "the order was very badly packed. all fries were scattered. and I ordered for a fiery hell dil, but received garlic dip. very disappointed", "what a shitty service. they didn't even send classic veg burger and when i called on their location no one seems to answer the damn call. this has happened with me for the 3rd time. i will never ever order again from this location.", "very late delivery, food was not hot", "good", "thanks for late night delivery and taste was also too good 👍 😋", "it was really yummy.. burgers sauce was amazing. really liked the finger chicken", "", "I have ordered 2 burger but received only 1", "please don't do this we love burger King so much\n\nand our kids too...", "", "", "", "catch up nahin diya aapane jyada 4 catchup diye 6 burger nikale", "best delivery person", "Burger was the best as well as the\nfries. Services of the that burger is also best and environment too", "It’s a great experience. The ambiance is very welcoming and charming. Amazing wines, food and service. Staff are extremely knowledgeable and make great recommendations.", "Very good taste. You can go for it ...............\nDelicious........🤤\nSo tasty 🤤........\nBurger is so yummy☺️☺️\nService is too good .", "Peri peri fries fan and always cravings for that so burger King shorted my cravings always for fries 🍟😍", "no straw. no tissue no spoon", "I have put order instructions on that and they haven't followed that. When I called with the Zomato team they told me that they forgot to check the instructions and didn't resolve my issue.", "", "Next time ' Please Add paper straw\n\nmujhe spoon se pina pasand nahi hai 👍🙂", "I told them specifically to make sure the fries are hot, the fries were soggy and cold. The burger was made as if no care was given in packaging. I demand some kind of refund", "", "", "", "", "whooooooo!!!", "", "", "Difference in price biling . From zomato team is not accepting their mistake. Biling differences are their.", "", "should improve quality & taste according to price\nvery bad taste seems eating at road side lauri", "", "There were no veggies in the burger. The worst taste of burger. no value for money.", "", "", "Fries are too salty waste of money", "1 burger not delivered 😡😡"]}, {"subway": ["", "", "", "", "", "", "", "", "", "", "they should inform which is veg and which is non veg", "", "very bad experience.", "", "", "I liked it", "", "Not a good experience even when instructions were given, only red chilli was added", "Horrible bread i feel cheated", "", "Hardly any sauce was there", "", "", "", "", "I ordered black pepsi and received a regular pepsi instead…. 🙁", "", "", "Along with the subway this incident has put the reputation of Zomato at stake. This is simply not acceptable. Awaiting your action and revert.", "", "", "Clients doesn't need to specify to heat their order everytime if they have selected toasted means they want hot sub. So please i hope you would consider my this regard.", "", "The bread was burnt and sub wasn’t at all yummy, please take that into consideration next time onwards.\nThank you", "add more tissue", "it was worst. even though calling the restaurant 3 times to send tissue paper, they haven't sent it. and the lady from subway restaurant was very rude and arrogant.\na big thumbs down to this.", "I ordered 12 inch paneer tikka sandwich but got only 6 inch.Very bad.", "", "", "incorrect option of breas was used.", "", "Pathetic experience. Pls refund me my money. As my mood was spoilt", "", "I ordered for my parents but later came to know that they received it short instead of 12 inches they received 6 inches", "", "", "Regarding water bottle- it costs too much… 50₹ for 500 ml.", "No sauces", "", "", "the bread is tasted too much so feels like burnt and the sauce is very less..", "bread was not fresh and cheese was not added even after taking money", "The delivery was late, and order had missing ingredients in it.", "", "Had ordered subway with mozzarella cheese. Received one without any cheese.", "They gave me half the order", "I got Mexican Patty sandwich instead of Panner tikka sandwich as they were out of the panner for my order. They should have updated the same on Zomato. But the Mexican Patty sub was good.", "", "", "Please write sandwiches name so one can segregate order. 2 stars deducted for that.", "the delivery guy was so kind and noble please tip his as much as po", "", "worse worse worse", "", "", "", "", "of tou don't have something in stock then cancel the order .... so send something equivalent the same amount of ordered.... not atleast cheaper option...", "Not even like the taste its really soaky and not good packing", "mixed up the accompaniments in the two salads", "", "", "Order is not as expected since last few orders", "", "", "", "", "", "every think is rong", "food delivery not proper as per order\nbecause order are different and received are different 🤣🤣", "", "it's not give order address, accept payment and after that they can't give dilivery", "", "", "we request for catch up sachet but they didn't send......need to improve their service...", "", "paid for cheese it wasn't there, asked also to add marinara sauce it wasn't there. bread wasn't toasted.", "no names were mentioned on the Subs so it was difficult to identify which one is for whom. please ensure names of the subs are mentioned next time. the food was great!", "", "", "it was cold", "fin", "", "Not at all acceptable, utter rubbish food", "very late service"]}, {"dominos-pizza": ["very good service... delivery got at time no extra waiting... I am full satisfied...☺️", "Bad experience", "", "I ordered the veg loaded but get tomato.", "", "very good service... delivery got at time no extra waiting... I am full satisfied...☺️", "Bad experience", "", "I ordered the veg loaded but get tomato.", "", "", "always great taste", "", "", "dilivery late.... Domino's policy 30 min free but 45 min at home pizza & cold please call back & msg me for regarding order", "", "Worst experience ever..food is not properly cooked..n amout of sauce cheeze and toping is too low..not recommended..", "", "very testy", "Thank you so much Ajay... Thank you Domino's..!!\nLovely experience..!!", "", "", "", "", "delivery agent was rude", "Taste was very poor", "", "", "paid extra to dominos even after full payment online", "pay for extra charges", "", "", "", "not odar thish odar change", "thanks for Ajay Desai please safe drive\nthank you so much", "no cheese for all pizza very bed", "I didn't get what I ordered", "I haven’t received my order.", "this is the farm house dominos will provide", "", "fast delivery by mr.ajay, appreciated,\nalso rest. done great work,", "", "worst delivery service\nfood got cold and moreover i had to go and take my parcel\ndelivery guy cant find my address", "What a joke you are making out of our money, I paid Rs 40 more as surcharges, Rs 60 apart as delivery and you don't even delivery Pizza with Chilly flex and pepper !! This proves you are not at all taking customers seriously", "", "3rd class Delivery service And 3rd class pizza.. Plz improve ur services.. Such u poor👎pizza place.. better pizza Is La’Pinoz And La’Milano is Good 👍… Bad experience Not Good 😌", "", "", "jesa soch ke mangaya Vesa kuch nahi tha pizza acha tha baki sab bakvas", "Please serve/deliver fresh food.", "Last night my experience with dominos ahmedabad is very bad at 10:50 pm they take my order and 11:05 they said we dont have this pizza now so we are canceling this order and at that time all other restaurants are closed so whole night we are starving and not able to sleep, i am very unsatisfied with dominos services...They broke my trust on Domino's", "Last night my experience with dominos ahmedabad is very bad at 10:50 pm they take my order and 11:05 they said we dont have this pizza now so we are canceling this order and at that time all other restaurants are closed so whole night we are starving and not able to sleep, i am very unsatisfied with dominos services...", "fast and safe delivery. delivery boy was responsible and respectful person. Thank you Domino's team.", "No Ketchup Pouch Were given", "", "", "", "pizza got tightened 😔", "", "", "", "", "", "", "next time, please add some catch-up, without it, it's less pleasant to eat", "good", "if you are not putting any sauce with pizza.....it's very dissatisfied because some one orders with home delivered food they don't want to go out and buy sauce for pizza....at least infirm that you are not putting any sauce pouch with it....not a single pouch....\n\nvery very disappointed with it....😡", "it didn't had enough of cheese compare to other company. dominos seriously need to up in game. delivery guys did fantastic job. he was on time even in rain.", "fast delivery, thanks", "add some more chess on margerita", "", "let delivery testless pizza hopeless", "cheese not properly", "Pizza is cold and delivery boy give me pizza in 55 minutes", "", "", "Excellent quality", "", "No", "very nice pizza,it's very delicious,n fresh dough.", "", "good job 👍👍👌", "very nice", "Good pizza, amazing taste.\nDomino's is known for its quality of food.\nI love the cheese burst 🤩 of Domino's in different varieties of pizza and the choco lava cake too.\n\nHope they'll maintain it each time.\nOnce we had a pathetic experience but they resolve the issue after a complaint raised by me.\n\nThey don't pay attention towards the dinein. One will always experience too much noise and chaos at the outlet. It should be improved.", "the person is really awesome Mr. prakash", "I don't like taste.. 🤮🤮", "", "good quality", "Amazing", "", "The delivery partner of dominos was denying to go upstair to deliver my pizza as he was saying that it is not our responsibility to deliver please pick it up from downstairs please take action against this as of zomato customer use this app for delivery of food products and dominos delivery partner says this to me that please pick it up from downstairs so i guess this could be a negative impact to zomato.", "Very bad quality pizza.\nCrust was very bad.\nWe had thrown it in dustbin", "no kachup no cheesy dip in se la pinoz achha proper pizza kha to sakte hai ye to ketchup aur cheesy dip garme dundhna padta hai", "Don’t fool the people from making such kind of pizza plzz its a hubble request to you and your company", "this is not double cheez pizza"]}, {"la-pinoz-pizza": ["Very bed conditions received pizza", "The quality of food was compromised. It was not like when La pinoz newly open.", "Wrong pizza sent … not worth", "", "", "Very bed conditions received pizza", "The quality of food was compromised. It was not like when La pinoz newly open.", "Wrong pizza sent … not worth", "", "", "pizza was very cold... disappointment", "the whole cheese fall aside", "", "why charges are different, there are no charges took as container than why should u taking charges.", "bill Is 185 Rs and payment deducted 213.25 Rs.", "", "", "worst delivery experience", "", "", "", "Even though cutlery was selected, it was not not sent. Instead of garlic dip some other dip was sent. Not enough sauce, oregano sachets sent", "", "Not worth it", "", "please improve", "Very Bad", "", "make it good", "", "", "", "", "", "", "", "", "Very bad quality\nSo disgusting", "cold food. worst experience ever.. won't recommend anyone", "", "", "", "", "", "😔", "good", "", "", "", "", "not properly delivered complete layer gone", "i ordered extra cheez but it like nothing added cheez", "all over worst", "not a proper test and it's item was not hot it's cold test", "Good", "", "Worst Delivery of Pizza Ever...", "not good pizza it's no in properly in oder", "Please provide good quality for food.", "bad food", "very good", "order was 15 min delayed", "Khrab test", "", "", "", "", "the delivery boy didn't have change at all", "very faster dilevery man 🤣😎😎😎", "", "third class Packing and toppings Come out very bad", "pizza was fallen", "quantity of cheese is less today compare to when we are eat pizza in dining in la pinoz", "", "", "delay in delivery", "", "", "If it’s exchange or replace then I appreciate you otherwise its okay I’ll nevr order on this platform.", "", "", "good", "got order very late on Saturday 7:20pm", "", "pl do not order by zomato.\nzomato delivery service was third class.", "", "It was the worst garlic breadsticks I have ever had. Total waste of money", "it's late", "Vety poorest Delivery i got my\norder after 1.20 hours just rediculse", "its very spicy but amazing loved it", "too much hard base.... bad quality of cooking", "", "", "It’s your pizza? How can i eat this?", "They don't care of customer instructions,\nAnd taking too much time\n\nDon't go with the name....\nZero professionalism\nParty spoilers"]}, {"pizza-hut": ["Ahmedabad top 1 Pizza Hut good and God bless", "", "Cold Pizza. Delayed delivery. very bad experience", "", "this pizza didn't have mozzarella only cream cheese topping gives a different feel not my kind", "Ahmedabad top 1 Pizza Hut good and God bless", "", "Cold Pizza. Delayed delivery. very bad experience", "", "this pizza didn't have mozzarella only cream cheese topping gives a different feel not my kind", "", "", "They have not added any of the extra toppings", "", "Really Disappointed as no follow up for cooking instructions were taken", "", "", "doesn't send with sause even I write in instructions.", "", "", "I need my my money back", "plzz increase utilization of pizza base", "u forget ketchup there is no ketchup in the prcel", "pizza was full of mayonnaise.. didn't like the taste..", "", "nice", "Not a single ketchup provided and took longer than expected", "more than one time you guys have disappointed my family", "", "Overall the food quality was not good as i feel I'm a beggar. The topic of corn was so less. just for a seek added i feel", "", "no topping nothing like sauce is given with my order except tissues very disappointing zomato delayed service with no proper order", "worst cold wet soggy tasteless and no cheese . just some cream. worthless chunks of baked bread base", "no ketchup in pizza put extra chilli flakes oregano", "wery bed coletty verrry bed Pizza Hut dilevery pizzas I am not happy my pizaa totaly go too dustbin totaly wested pizza with happen your store gues", "Would expect a refund for it, but I know I won't receive it.", "Absolutely cold and dry . Not expected out of Pizza Hut", "", "", "", "", "Please is not hot and pizza is not good", "waste of money", "", "pizza are same we have order different", "Worst Pizza I have ever had looks like onions are also not fresh. Even other pizza stores offers good pizza. Had to let it go. Also please refund if possible for the dirtiest taste I ever had", "Everything was tasty but you didn’t send me Dip", "Ok", "Worst pizzas i have ever had in my life..all 4 pizzas were same…with minimal chicken pieces..pathetic", "", "", "", "", "pizza was not baked properly", "DOMINO'S PIZZA IS BETTER THEN PIZZA HUT", "Please don't order this 4 combos, this is completely rubbish.\n\nonly brade is available.", "very bad experience.. Food is not at all good.. Mayonnaise not given.. Total waste of money..", "Very poor service and taste", "", "No oregano recived delivery boy told company nahi deti", "test zero hizza hut zero test koi na liyo", "Good 😊", "", "Pizzas were delivered cold, there was no bag or hot bag for delivery !", "", "delivered 1 hour and 20 minutes", "", "should be more tasty base was not good feeling taste less", "very bad exp...cold food n missing items...had to throw all food", "It was amazing test and good cheese garlic bread\nAnd also like service for fast and food was hot I really like it", "it was very dry and cold", "", "", "Order was not hot . It was at room temperature. Seasonings given only one sachet.", "super test", "", "We recived a order but it's cold pizza to much time was taken by resturant side. Disappointed with the order margarita pizza just a floppy bread nothing more than that no flavour of chesse and pizza sauce", "I really like pizza hut your pizza base is good and fulfy and also like cheese garlic bread I am happy", "Food was good and I really like pizza this is delever hot pizza and my order pakaging is very good I like it", "Food was good hhhhhhhhhhhhhhhbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbaffaf gagagagsvsusb hsgsghhsb", "", "", "", "Doesn’t look like pepperoni pizza\nCold pizza\nNo oregano\n\nNo chilli flakes", "not cut ..how can we", "Ketchup was not delievered although i paid for for it then also", "", "very bad", "ok", "Free pizza was not delivered only …. Horrible people", "got wrong items and worst!", "itana kharab to aaj tak nai dekha", "Delivery was too late.", "", ""]}, {"evening-post": ["", "", "", "little spicy it was rest was good and delivered on time", "Total mesup not paking properly\nsweet & subji mixed", "", "", "", "little spicy it was rest was good and delivered on time", "Total mesup not paking properly\nsweet & subji mixed", "", "", "it's too sweet", "I already said maintain the quality\nCompletely disappointed", "Food is good but all oil drained in bag", "The payment was made online still the delivery boy took 200rs extra from the customer it was for my jiju.", "Evening post Wale apna Chinese food banane Wale staff change kare bahut gahtiya soup he . Ye soup white kab hota he ?\n9879356747", "poor test , it seems Cook is new this time .\n\nwe have order spring roll from same restaurant 5 times , but this time waste of money , no returns on food taste.", "", "", "very bad food quality completely opposite from restaurant", "packing is not so good", "I feel that only 50% of the cook's attention is in preparing the food. 60% focus on cooking instruction. The chilies were not freshly fried. 300 rupees worth of food from my order was not worth eating. Despite spending 781 rupees, there was no taste, satisfaction and joy in the meal.", "The Sabji is very very tasty and delivery was on time 😋😊", "good service", "Restaurant had follow instructions of less oil, food is tasty and nice", "on time delivery", "Too much oily food", "the volume was very less as compared to the price", "", "very cool and very late delivery for your app problam and app server down", "food is very bad don't order evening post food no dog will also eat this type of foof", "", "", "super delicius", "very bad", "", "", "inhuman..not ready to change order...if you bymistake or confusely places order they not ready to understand", "Overall food taste is good but too much oily food", "it was way too sweet", "", "We recommend plain rice but jeerarise was served", "", "good qulity", "", "worst experience. Hydrabadi biryani was too spicy. not even able to swallow its just very very spicy", "i told No spicy Full spicy", "", "", "Nice & tasty", "", "Seal your bag and send the order. Horrible experience. The food was all open.", "", "", "", "Tasty food but noddles were too oily", "", "need to improve in Naan and rice", "nice food", "Not eatables", "", "Food was spilled in the bag\nNot acceptable\nVery bad\nI demand justice", "", "not good", "Got served plenty of hair. All the guests from banquet hall exit through the restaurant and which make entire experience noisy.", "", "asked for veg subji but put only paneer. told in instructions not to put paneer at all..!! deaf aren't we?", "Nice flavour food", "", "", "price little high.", "nice", "", "Not satisfied with zomato services", "No onion No sounf why ? Not Good experience.", "told you to bring 1 Jain platter\nyou send both regular", "food packing is not good.. pls make some better packing...", "evening post food is always best", "", "", "", "", "", "", "", "Rice was not properly cooked …poor quality lemon provided", "", "food was absolutely delicious at decent price.", "Green cuury was good,\nbut rice was salty", "did not enjoy the food.", "", "", "good service", ""]}, {"stuffs-food": ["It was way expensive for portion sizes. 230 average for paratha, which is not sufficient for even 1 person, ordered chhole bhature worth 220, chhole was in small katori not even sufficient for one bhatura, katori was size of which we get in unlimited gujarati thali restaurant.", "Rude man who sits at the counter. Our entire family and friends are boycotting this place ONLY due to this bogus, non sense and rude person. Also informing everyone that keep ZERO HYGINE.", "We went here on a Sunday so it was 30 mins waiting. The waiting was worth the taste. We had ordered 3 kulchas\n1) Whole Wheat Mix Kulcha with chole - 5/5\n2) Whole Wheat Paneer Cheese Kulcha with dal makhani 5/5\n3) Onion Garlic Cheese Kulcha with Dal Makhani 4/5\n\nAs it was a Sunday, the service was pretty slow. Also 1 thing I did not like is that they do not provide onion salad as complementary instead give raw shredded cabbage. When asked said we do not provide onion..", "Such good food. We ordered Manchow soup, paneer tikka, masala papad, paneer garlic kulcha, dal makhani and lassi and everything tasted so good. Staff is also very courteous.", "Roti was not properly baked\nKulcha was over baked\nSabzi have no taste and no spices\nAll food are too cold", "It was way expensive for portion sizes. 230 average for paratha, which is not sufficient for even 1 person, ordered chhole bhature worth 220, chhole was in small katori not even sufficient for one bhatura, katori was size of which we get in unlimited gujarati thali restaurant.", "Rude man who sits at the counter. Our entire family and friends are boycotting this place ONLY due to this bogus, non sense and rude person. Also informing everyone that keep ZERO HYGINE.", "We went here on a Sunday so it was 30 mins waiting. The waiting was worth the taste. We had ordered 3 kulchas\n1) Whole Wheat Mix Kulcha with chole - 5/5\n2) Whole Wheat Paneer Cheese Kulcha with dal makhani 5/5\n3) Onion Garlic Cheese Kulcha with Dal Makhani 4/5\n\nAs it was a Sunday, the service was pretty slow. Also 1 thing I did not like is that they do not provide onion salad as complementary instead give raw shredded cabbage. When asked said we do not provide onion..", "Such good food. We ordered Manchow soup, paneer tikka, masala papad, paneer garlic kulcha, dal makhani and lassi and everything tasted so good. Staff is also very courteous.", "Roti was not properly baked\nKulcha was over baked\nSabzi have no taste and no spices\nAll food are too cold", "", "Best punjabi food in ahmedabad, must visit place, u will go again and again……………………….\n..,,.,,,,,,,,,..,…,…..,,,,,,,,,,,,,", "I had chur Chur naan combo. Chur Chur naan were served with dal makhni and raita. The chur Chur naan was very simple as like simple stuffed naans. But the taste of Dal makhni was awesome.\nI will not recommend to eat Chur Chur naan who loves chur Chur naan and who ate earlier.\nthey will not love that.", "There are way better options for north Indian food with better quality and better ambience. Not happy with portions also. Lesser stuffing. Worst churchur naan ever eaten.", "Tasty combo of kulchas with chole...\nWagha biryani n pulav are a must try.... Authentic taste n delicious dishes", "", "This place serves the best vegetarian biryani... I love to have their delicious waga biryani... This places gives a feel of proper punjabi food and ambience... Would totally recommend this place...\nAnd do try their waga biryani... Give your feedbacks in the comment section😍", "", "", "", "", "", "The way they gives dal Makani with stuff khucha is awesome.\nBest taste with perfect combination.\n\nStrongly recommend for all foodie in Ahmedabad.", "", "", "It's the amazing place for kulcha parathas, food taste is delicious and service here is also good. You must try Lassi and wagah Biryani and select any paratha they are all good and it's also in budget so take your friends and family.", "Food is excellent.Will Visit this place again with my friends.Staff is Polite and attentive.Competitive Price..Chat was Yummy , and the cheese stuff kulcha was very nice they serve it with Dalmakhni or Cholle.", "This place is amazing.My favorite dishes are mix kulcha,wagha biryani and patiyala lassi.I Have been there many times but they never disappointed me.Amazing food with nominal rate", "Limited space and if you are here for take away then people will less bother about you...\n\nThink before you do take away.. food quality come second when service is not satisfied......", "This place is very very near to my place so we order quite often. The best part is the attendant on call is always very polite and soft spoken. We have tried kulchas at ample of places but none of the places even come close to kulchas served by them!\n\nI have been eating at stuffs since they merely had a small thela near atira. They are still maintaining the taste.", "Looking and reading at the reviews, I was assured that it’s going to be a good dine experience but it turned out to be not up to the mark. We ordered 4 different kulchas initially:\n\n1. Cheese chilly garlic - you’ll not find this one in their menu but I think, this is the only one to try. Don’t miss this if you are there.\n\n2. Mix kulcha - Very mild and normal in taste\n\n3. Paneer chilli kulcha - I don’t know why did they add chilli in the name, because it was all tasteless. It felt like saltless kulcha.\n\n4. Aaloo pyaz kulcha - Nothing extraordinary but better than the above 2 fancy ones.\n\nAfter eating the above, we just not wanted to risk any other variety so ended up ordering 3...read more", "Unique experience of trying Amritsari Kulchas in town. The complimentary Chhole they serve is just out of the box. Must try their ‘Wagha Biriyani’. Little bit expensive according to their place ans service but sometimes it’s okay to do something for your tastebuds.", "Had visited this restaurant some time ago for lunch. Ordered the platter and buttermilk. The service was bit slow.\nFood 3.5/5\nAmbience 3/5\nService 3/5", "Taste of actual north indian food, Stuff's is best for the Kulcha and Patiala Lassi(Bohat heavy hai). Looking forward to dine in again soon.", "order serving time is too much food is spicy , in all kulcha nd paratha thy add so much chilies , serving staff is dumb . opening time is late .staff is arrogant", "I have been forced to change my previous 4 star rating of this place to 1 star (even its -1 star)...\nWe have horrible experience of this place last Sunday...we were there to celebratey mother's birthday with family and guests..\nWe have ordered our food and waiting...we have cut our cake , complete celebration and still waiting and after around 30 mins..and after starter...we were waiting.. waiting and waiting.and for 60 mins no food...we have asked restaurant about food and initially no body respond..after many complaints we asked owner and apart from apology ..he started questioning us back that 1 ghanta kaha hua hai? 😠😠\nThan we were served roti first and sabhi came after 10...read more", "One of the best place to go to in Naranpura. Cheese butter masala is personally my favourite,but it's not on the menu so have to order separately. Hope they add soon on it. Ambiance is cool. staff is also polite.", "We have been there long time back. Awesome place for Kulcha. I have done customization for Kulcha which was Cheese Chill garlic and that was awesome 👌 perfect combination of all mixture. Definitely try this combination if you are cheese lovers with garlic taste. They served with chhole and curd and all tastes super yummy together. Bestest Kulcha ever👌 Lassi was awesome proper patiyala Lassi.😍", "Stuff's is one of the most popular Punjabi food restaurants in Naranpura, Ahmedabad. Most of the time it has waiting line for getting in the restaurant. The food of Stuff is absolutely to die for. They have a crazy collection of authentic Punjabi food. And their lassi is a must have. But between 2 people order only 1 lassi. Because it's too huge.", "I visited their navrangpura branch today🤩😍... I was pleasantly surprised with this place .\nwhen you entered with fine craving , it raises your hope for traditional Indian delicious food ...\n\nI ordered😍😋😋 gobi onion kulcha ,Aloo cheese kulcha served with chole or daal makhani ,two types of chutneys ,achar, curd, salad ,pani puri and dahi chaat for starters .chola in khulcha combo proportionately spiced , cooked to near perfections , the kulcha was so big (2 persons can\nhave it).\n\nA very pocket friendly meal, a highly satisfied foodie .\n\nDefinitely recommend✌👌 . will try their other food variety soon🤩 ...", "Wow. I've been there twice and both the times they've surprised me with the taste. We ordered their platter and the kulcha was just yummy. Also, their chana and dal makhani is just amazing. We tried their biryani and my my we were surprised with that. Just amazing food. Although, it is very clustered due to short space and many tables. Recommended to visit with your family just for food. Don't try romantic or buri celebration there.", "Authentic punjabi food is served here. Amazing taste. Specially their signature Dal Makhni and varieties of Kulcha. A must visit for original punjabi taste.", "I’ve never been to Stuff’s before until 4-5 weeks back. I was pleasantly surprised with this place. We had Pani Puri and Dahi Chaat for starters, Onion Kulchas and Veg Masala Khichdi for main course. Dishes were decent. Chola in Khulcha Combo was proportionately spiced. Cooked to near perfections.\n\nService was okay because we visited during rush hours in Sunday evening. Parking can be a pain here during peak hours. Overall, I had a good experience. Will be returning back sometimes soon.", "\"Wagha Biryani\" our all time Favorite from Stuff's😍\nIt's a theme based biryani with India's Flag colors in it, representing Wagha Border.\n.\nComing to the taste it's mouthwatering dish amongst Stuff's other dishes😋😋. Everytime we go this biryani is mandatory. The quantity is huge😄🥰.\n.\nNOTE : Enough for two people.\n.\nPresentation : It's very well presented and served☺️\nYou can see in the picture\n.\nVisiting Stuff's and not trying this biryani will keep you in regret😂 (JK)\n.\nAt the end there was an orange candy in Refreshments, that we get primarily in Punjab during travels and so on.\n.\nTotally Punjabi taste and a thumbs up 👍\n.\nRATINGS - 4/5\nAMBIENCE - 4/5", "stuff is one the best restaurant which serves typical north indian taste\n\nthier navrangpura outlet is too small but you will find crowded everyday\n\nfood was good with perfect touch of north indian spices but was little salty\n\nif you are only lover of punjabi food then this place is for you\n\nambiance-3/5\nfood-4/5\nservice-4/5\n\nthank you for having us", "First of all I wanna tell that we opted for pure Jain food. So, we ordered mix stuff kulcha which was amazingly prepared served with chhole, curd and green chatni. Den we ordered paneer tote tote and vegetable kadai which was very mild and average in taste. In all, I liked the kulcha but not dat much satisfied with the Punjabi food served to us.", "Best food I've had in last many months...I loved their kulchas and the royal lassi.. if you are Indian foodie than must have kulchas and chole here...the food taste is very nice....ambience is appreciable...service was too good...and the staff also 5/5...A must visit place", "The food here is amazing..!! Budget eating at it's best..!! Awesome choice of Parathas. Seating is okayish but the food really compensates for it.", "Food 5/5. Ordered the second platter on the menu. Their chole is the best. Amazing taste and good quantity provided. Tikki chat was also good. Service was average. Ambience 3/5.", "Visited this place with family\nThis place serves you the best authentic paratha in town\nSpecialists\nWaga biryani 😋😋\nNd The Giant Glass of Patiyala Lassi😘", "Lassi is something all of us like it and must have tried different types and variety of lassies and different flavours of it but this lassi ddint have any sort of flavour essence or any trending ingredient in it although a simple but trust me it proved to be above all lassies I had till now. That thickness in it and a true taste of sweetness in it made it so tasty and the way it was served super chilled made the lassi so amazing 😋. And if you go to have it dont go alone 😀 not because of any other reason but only because alone you won't be able to complete it, it is so big served in a punjabi style big glass and once you have a sip of it you won't able to stop. Must must try 💕", "Bahut hi badhiya place hai punjabi food k liye and the taste of kulchas and ptiayala lassi , curd , chutney is sooo amazing...WooOow\nI strongly recommend friends very nice place to go and enjoy with family and friends", "As usual, stuff’s food never disappoints you..!!\nWe generally have a take away from this restaurant as I think the space to sit out in the restaurant is quite less..!!\n\nMust try\nWagah Biryani\nAny damn kulcha\nBlack dal\nPatiala Lassi\n\nThanks..!!", "Perfect Blend of Amritsari food....Aaloo, Paneer Chilly molly Kulcha's are really delight to tummy....\nFantastic exp...must visit.\nAll ingredients are perfect and makes the place worth for Foodies.", "This place serves authentic punjabi food. They offer a wide array of kulchas to choose from.\nThe ambience gives the perfect desi feel. Also, the quantity and taste justifies the price. It is beautifully served with chole, side salad, curd and chutney. We also had their gigantic glass of lassi. It was lip-smacking. Worth trying.", "Oh my God, Yum Yum Yum! 😍😍\nExactly that's what was my first reaction after the first bite ! Honestly, they have such perfect taste of the food: may it be kulcha or dal makhani or chole or paneer cheese butter masala, everything is aced up and soothes your craving satisfactorily! Although, ambience is nowhere compared to the food and service lacks at the time of crowded days like Sunday! Nvm, food shuts the rest!", "Awesome parathas. Tried the planner garlic paratha with cheese . It was awesome . Comes with curd, chutney and chole/dal makhani ( u can select ) . Service was very good. Waiters were polite and courteous. Also the food was served quickly . Not giving this place a five star due to its ambience and hygiene.", "Situated on 1st floor in a complex with a small entrance will create a adverse illusion of the place, the same with the short menu, however first glance at the Parathas will clear all your doubts every item on menu have a distinct taste impact. Best being the Mix Paratha which was thick though crispy on out and dint feel a lot to take on tummy, the Dal Makhni was absolutely satisfying punjabi delicacie. Glad o have been der.. 👍🏼", "The place was good with good seating. Ideal for friends and families. Service was good. Food was also good. Ordered a platter which included laccha paratha, aloo kulcha, chole, dal makhani, curd, a gulab jamun and a chutney.\n\nLaccha paratha: 3.5/5 mediun soft 5 inch partha with butter\n\nAloo kulcha: 3.5/5 stuffed with potato stuffing 6.5 inched kulcha\n\nChole: 3/5 taste was good. Less stars for less quantity. It wasn't enough for a single person.\n\nDal makhani: 3.5/5 tasty but again not enough for one person\n\nGulab jamun: 3.5/5 good but not best. Soft enough but lacked the perfect flavour.\n\nOverall: 3.5/5\n\nPS: seeing those orange candies in mukhvas, that was awesome. For mukhvas 5/5.", "Kulchas are best one, but the Biryanis are worst. Overall good service for small group!!!\nLiked - Paneer Chilli, Paneer Garlic, and Mix Kulchas\nDisliked - Wagah Biryani", "The food is total value for money and in Ahmedabad it serves one of the best punjabi food. The service is also generally very fast but in case of peak hours you will have to wait for seating. Lassi is a must try. If you are punjabi food lover then this is a must go place in Ahmedabad.", "If you want to get the real taste of north indian food, look nowhere. Get there well before time else you will return back hungry on weekends.", "This is the nice place for eat to kulcha.my experience is very good for this amazing restaurant.i have suggeste to all people who eat kulcha and dal makhani.plz visit that place and enjoy it.", "Very poor quality of waiting system\n\nWaiting list is you have to be present at the time of name call once you are not present name is cancel\n\nAnd waiter teach me what is waiting system is\n\nVery ver y poor", "Authentic Punjabi food with diff options of Kulcha and SUBJI!! MUST TRY IS LASSI OF STUFF'S..their platter option is also very good must try", "i have visited this place many times before. but at this visit felt like the quality become very poor. no cleanness. no quality.\nthis restaurant has open many branches. i think it is main reason behind that.", "A small spaced outlet.\nInteriors are OK, always crowded on weekends, The lighting is a bit dim. Service is prompt.\n\nHave tried several Kulchaas, out of which Mix Kulcha and Paneer Chilly Milli we're the most unique in taste and satisfying overall. Taste of Cholle is good as well and curd and chutneys are good in quantity.\nPatiala Lassi is good as well, hard to be able to finish one alone. Kheer is good too, but quantity wise a bit less.", "Reduced my rating to 3 stars since they reduced the diameter of their kulchas. At first one kulcha would be more than enough for one person, but now it just doesn't cut it, plus you don't feel lile ordering another one because it will be too much and hence kinda an issue.", "Great awesome place, super food just a little disstasfied with service otherwise it was a great experience. Loved the kulchas and the creamy yummy buttery chole they serve as a accompaniment. One kulchas would be heavy enough if you having buttermilk along. The buttermilk was also creamy yummy and tummy filling. Sorry mention about starters the always hot favorite of kababs. \"The great, long of Kababs...... hara bhara kabab it was awesome and the chutney extremely delightfull", "This was my 3rd visit to Stuff Naranpura. This visit was absolutely pathetic.. We have suggested this place to many of our friends but utter disappotinemt during last visit.\n\nFood :\n\n- Quality of food was not upto the mark as they had earlier - We found PLASTIC in their palak paneer this time, even after founding plastic their senior staff agreed to change it with some other dish but he didn’t even bother to ask once whether we got replaced dish or no..\n\nService :\n\n- Getting worse day by day, they’re multiplying their number of stores in the city but they should not compromise with quality & service part in their flagship outlet.\n\nVery disappointed and would NOT like to visit...read more", "Dil thaam lo punjabi lovers ❤\nPresenting : Stuffed Kulchas 😍\nServed with love, chole & dahii 😋\nKulchas here are stuffed with various types of veggies, cheese, panner , garlic & with a whole lot of butter on the top ☺\n\nThere is a special dish known as bagha biryani where they represent the relation between india & pakistan, they have a punjabi lassi which is a big glass full of sweet curd & by BIG i mean REALLY VERY BIG !\nyou will find waiting during the night, afternoons are good, sundays are not suggested, waiting is atleast 30-45 min.\n\ncost for 2 : 500rs\nTaste - 5/5\nPresentation - 4/5\nAmbience - 3/5", "I would rather give three and a half here. We tried the yummy Platter-II of gobi paratha, masala paratha, chole, dal makhani and gulab jamun. We then tried Paneer paratha which tasted really good! And how could we not try the humongous Patiala lassi!! The food was really good but what disappointed was the ambience! The tables and spoons were untidy and the place didn't smell that good!", "I love stuff’s food but I suggest to owner about lighting it’s too low .\n\n\nStaff -: 05/05\nFood -: 4.5/5\nManagement-: 5/5\nMoney -: 4.6/5\n\nOne thing I really like about customise in platter 2 . You order same thing you can do it .", "We got paneer Tikka dry for dinner. We got the food on time but the quality was bad. Panner was like chewing gum, the masala on the tikka was also improper. Overall the dish was tasteless. We had much better experiences at Stuff before, but this proved to be a huge disappointment.", "Boy! What a taste!\n\nMy friend took me there and I found the decor and over all ambience bit clumsy & mediocre! But the food! Sumptuous!\n\nThe staff is super friendly and gives you all the info about the dish! We wanted to order quite a lot but the steward advised us against it! He recommended that we must finish our platter first! Two guys! One platter! It was a perfect advise and both of us were literally full till our throat! Such a lip smacking food!\n\nDal makhani... I never had such taste before! Hats off! Kulchas, lassi everything was just perfect!\n\nFull marks for food and genuine staff!\n\nNext visit to Ahmedabad and I will be there at Stuff’s!", "Stuff's, they food actually stuff you fully! I have visited this place quite some time back and ordered Mix Kulcha, and infamous Lassi! I barely able to finish half the glass! one of the places in the city where actually, you will never complain about quantity or quality!", "Their Tomato Cheese Kulcha and Lassi is my favourite. I must've had this combo for at least five times till now.\n\nThough, once I had ordered it online from Gurukul branch and the quality of the Tomato Cheese Kulcha wasn't the same as served in Naranpura. Anywho, this place is a must visit.", "Best restaurant for punjabi cuisines specially for chhole-kulche cozz trust me guys they serve amazingly delicious chhole kulche. Ambiance is also quite good but it's too small for a big group of 10-12 peoples. It would be great place to dine if prices could be lower. Staff is also friendly. Overall a must visit place for punjabi.", "One of the most authentic Punjabi food in the city. The best part is the Restaurent is very simple and the food is extra ordinary the kulcha is so huge and yummy. Mix Kulcha is a must try", "Tried first time after listening from many.... Was going through menu but ended up ordering as per instruction and clubbing of 2 combos (by manager). The order was supposed to be combation of 2 stuff but they mistakenly served only 1., which they admitted after our half dinner, managed to refund the same.... Now coming to taste - little on spicy side, Northern touch, dress up like Punjabis\n\n\n\n1 time visit according to me", "If you are looking for an AUTHENTIC punjabi taste (With a little bit of Gujarati touch), the first place you want to visit is Stuff's. As the name itself suggests, the menu is stuffed with delicious punjabi cuisine along with some tasty appetizers & great biryanis. Soft drinks & buttermilk is also available to accompany your meal, but the best way to accompany your meal is lassi, If you can finish it on your own.😂 & oh yes, service is very good & prices are moderate.", "Stuff's is for casual dining when you don't wanna eat home (When it happens twice a week just like in my case). The place is not so hard to find, its on the western side of the city and in less crowded yet established area of Naranpura. The food joint is not so roomy and they have tried to keep it simple with orange lights and Backlit Golden Temple photo frame on the wall which gives you some 'Punjabi' feel good factor with starving stomach and Tempting aroma of Butter rich parathas on the table.\n\nFood here smells good and tastes also good. The Service needs improvement for Order noting and delivery on the table timings. Cost because of aforementioned reasons needs to be justified.\n\nMy...read more", "Its a perfect place to go for a tummy filling experience in good budget. Everything here is tasty and looks very fresh, the staff serves with a smile as well making the experience memorable.", "One may find this review contrary to the rating attached... What else would one do if there is a waiting of 1.5 hours (90 mins) on a Monday! Stuffs, surprisingly doesn't have a capacity to serve groups... Anything more than 4-6. We were 11 and hence the waiting... Having said that stuffs is the place to go to for most amazing stuffed kulchas of Amdavad. We started with karara kabab (paneer stuffed in crispy covering like a spring roll but far better) and it was not just novel but also super tasty. Kulchas were Served with Dal / chhole (diamond on the shining star), curd, mint chutney, jaggery, green salad... And a pizza cutter as the size of kulcha is immense, one definitely needs to use...read more", "***Makke di roti sarso da shak in the chilling winters are must!*** Makke ki roti 4.5/5\nSarso ka saag 4/5\nGajar Halwa 1/5\nKadi pakoda: 3.5/5\nValue for money 3.5/5\n\nPrice: ₹350/- 😋🍱🍵", "The food was so delicious and relatively good price but the next day our stomachs got really bad. You can’t resist the taste that they have but oh man! We were suffering next day. Take care while you try this place. May be it’s just us who got sick but I would say please make sure you are aware of this while you eat.", "Food is really very delicious.We had platter. Kulchas were yummy served with dal makhani and chhole.  Cant accommodate more people at a time so have to wait for long hours on weekends. Service is good staff is also nice. Overall pleasant experience", "The best paratha experience of my life. Just loved everything that we ordered. It started with a complimentary salad which was fresh and tasted good. Then the two paratha meals with Chole & Dal Makhani. One of the best I ever had. The Lassi was so huge, we thought we would never be able to finish that. But we did. It was that good. And the Kaju Pulao was also very good and unique in flavor. All in all a total blockbuster meal.", "An amazing and typically Punjabi place. One of the very few in Ahmedabad. The seating and Ambienve match the cuisine itself. Should out the family parantha and life-sized lassi.", "A perfect place for Eating Quality Punjabi Food with every type of Quality food available.\nLoved its Dalmakhani with Rice & Specially It's Dahi Raita provided along with Platters.", "Who will not like kulchas and that too wen u get the authentic punjabi or amritsari kulchas here in the town...all types of kulchas are best and they reach up to my expectations of taste.\nWinter starts and for all the ppl I suggest you to try this place asap.\nAnother interesting dishes which we sometimes overlook beside kulchas are stuffs special biryani ohhhh this is so delicious and made for cheese lovers try this for sure..\nAnd another biryani is Wagah biryani which tastes yummy two different flavours in one biryani...\nWen winters here visit stuffs..\nAmbience 3.5/5\nFood -4.5/5\nService -3.5/5", "The photo attached is the menu card at the restaurant. You can see that the rates are lil higher there than what shows in zomato menu. It clearly says that the rates they have mentioned are including tax still they are charging extra tax on it.\n\nThese guys are earning out of food as well as taxes.\n\nScammers !!!!", "Visited the place multiple times! If I can't make decision where to go, this is the place I would like to end up. Their platters, parathas, kulcha everything worth! Hydrabadi biryani was the best one!", "Good but a little overpriced considering you get almost the same thing at cheaper prices at other places.\n\nWe tried almost all the stuffed kulchas which they serve with chhole, curd and 2 chutneys. They were all pretty good with generous stuffings (1stuffed kulcha is big enough for 1 person to have a full meal).\nThe pulav and lassi was good too.\n\nIt's a rather small place with minimalistic decor. Its almost always crowded and there's plenty of noise going around. So not great in the ambience department.\n\nAll in all its a nice place more suited for family dinners than for hanging out with friends.", "Awesome food... love the kulcha and dal makkhani.. awesome platter.. delicious in taste.. so yummy.. nice place even. I also prefer for enjoy food at home as they provide home delivery."]}, {"honest": ["", "taste is not good...", "", "rava dosa was (2x)salty n bhaji was very less salt... i cannot eat salty food, for first time got salty food from honest! unlike honest taste.", "", "", "taste is not good...", "", "rava dosa was (2x)salty n bhaji was very less salt... i cannot eat salty food, for first time got salty food from honest! unlike honest taste.", "", "Test Not As Per Honest Prahladnagar Test", "Not good\nThey don’t read your instructions\nThey will prepare on their own", "The entire order was very cold and spicy", "overall good.", "", "good", "", "", "", "good food", "", "", "", "mujhe bhot bura laga ap ki service aur pizza bilkul krb pada hai mujhe smjhe me nhi aarha hai ap log enti krb itam kesa Castmar ko dath Ho kbhi online odr karna ka vichar bhi nhi kar payega mujhe to Zomato aap bhi delete karna padega aj se thanku", "too spicy", "Always loving it", "", "", "not satisfied", "", "good test", "", "Everything was excellent. As expected from Honest, taste and quality both were top notch!", "", "very delay delivered item.", "", "didn't deliver the items and declined to support stating he did.. first ever experience", "wrong order send", "good taste", "Spoon 🥲", "", "Found a dead cockroach in packaging. Ended up throwing the food.", "ok", "", "This restaurant has the bad habit of forgetting things. forgets sabzi in thali, forgets extra pau with baji pau, forgets onions and lemon etc", "Just dont oreder from zomato and honest they will not serve you right.", "Not delivered proper items", "thanks nice service", "Not happy with Honest and Zomato as it is moral responsibility of Zomato to check the order before taking delivery from vendor for customer as nothing is coming for free", "", "", "👍", "the taste was horrible", "not like the packaging special for noodels", "thanks", "", "service is good but deliver lied to me that I am here on location", "They followed my additional instructions which generally restaurants dont do.", "", "", "", "", "h", "", "", "They send regular bhaji instead of jain bhaji after mentioned at the time of order very bad restaurant plz dont order form here", "very bad", "I have ordered single pav extra i have paid money also but i didn’t get in my parcel.", "", "Yes, give option of chilly, very chilly or no chilly.", "", "Not like c g road honest", "They dont read instructions. instead of swaminarayan pav bhaji they sent regular one. worst experience.", "", "", "nothing specific", "bad quality of chatni and also very low in quantity for and sambhar as well", "very bad", "", "", "", "it's totally bad experience, In future I'm avoiding Honest resturant, cause they are scamming the people, worst food ever", "", "", "it was awesome 😎", "", "what the nonsence packaging", "completely messed up thali.. o rating", "Please increase the quantity for your charges are aleardy way too high", "every time order delay is happening", "", "", "", "good food", "food massed up with each other"]}, {"puffizza": ["The puff pizza was totally undercooked", "taste is good but more time taken either in making or delivery, dont know.. but it was late.", "", "the food was hot", "pizza reached cold, plus no oregano served with it. its a basic practice one should be careful about", "The puff pizza was totally undercooked", "taste is good but more time taken either in making or delivery, dont know.. but it was late.", "", "the food was hot", "pizza reached cold, plus no oregano served with it. its a basic practice one should be careful about", "cold food", "wow yummy🤗👌 good delivery boy", "I love their puff based pizza and also most cheesiest pizza 🍕 must try thier puff based pizza available on Zomato and dining too", "", "taste isn't good", "It was cold when received otherwise would recommend cheesy margherita pizza.", "no cheese in pizza", "", "", "", "Its too loose .. not baked…", "Horrible experience. Worst food. Worst restaurant. Food was cold due to delivery delay. Worst service by zomato. Swiggy is much better.", "Please make puff base pizza in such a way that during delivery it does not becomes somewhat liquid and soggy. Otherwise taste is very good of the pizzas especially cheese master is well done product.", "", "", "", "Bad experience.", "poor quality", "", "", "everytime ok with this item i am not satisfied with this time item item is ok bt not cooked or baked properly", "", "first thing it's not hot and not satisfied 😒 😕", "", "Delivery is late due to the same quality is not good", "Best mushrooms pizza with cheese, just cream chess is not in enough quantity.", "", "", "The food was served cold", "", "", "Pizza is not warm due to late delivery", "", "no cuttlery they are hopeless rather who will eat this kind of ffod without bag and cutlery", "", "cold pizza", "", "", "good persion on dilivery on time", "", "delivery is bit late.", "", "not good tests", "", "", "", "there was no cheese in the pizza", "jordar", "add more stuffings n make thin crust", "please give my refund", "pizza was ordered with cheese burst base but not given.they were charging 100 rs extra for base. I want my money back.", "Bakwas. Not fair...", "As per price size is very very small", "Very late dispatch", "", "Quantity was too less according to price", "very high price this product, i never order next time", "just the pizza for just the midnight pizza cravings...\nreally enjoyed the crust with just the right amount of cheese n veggies naked to perfection", "i ordered 7 cheese and i was sent cheese corn and the person on the other side of the phone call who he said was manager of that particular branch wasn’t even responding properly.", "Damage pizza and very salty in test.\nLate delivery", "late delivered nd poor test", "The restaurant didn’t send the proper order which we have placed and don’t get item like ketchup which I had paid money didn’t received\nWorst service ever I seen", "", "Delivery guy behave very rudely\nWhen i asked for bill then he denied that we don’t have bill\n\nWhat kind of behave is this?", "", "", "", "Yummy 😋", "", "", "no deep fry and i all was remember to deep fry but won't to no deep fry", "Soggy pizza and tasteless and low quality", "પિઝા કાચો મોકલ્યો", "", "If u provide home delivery then pls improve your system or else change the rider.", "", "", "", "", "really bad experience with the instructions of my order.", "", "Paid for extra sachets of oregano got only 2", "", "good taste", "superb tasty"]}, {"coffee-culture": ["Must try 3 three layered pasta here", "", "brownie generally it's hot not cold", "", "", "Must try 3 three layered pasta here", "", "brownie generally it's hot not cold", "", "", "", "", "", "an amazing this is my 8th visit", "Very good experience with a good and co-operative staff", "", "", "", "", "", "I had an excellent experience while having dinner here. Beautiful ambience, live screening, rooftop & good food makes this place one of the top-rated places in A-town!❤️", "", "food quantity is so low I mean sabji was just 50% of container and staff is not taking responsibility of it. they are arguing about it", "", "", "Average taste and very high pricing. Not pleasant staff behaviour.\nAmbiance is nice and comfortable. But food quality average.", "", "Too much ice. Very disappointing.", "Extremely bad\nPlease don’t waste your time & money\nPathetic food & beverages too\nUnprofessional staff & overly prized menu", "", "", "", "All items were requested to be non spicy. No attention given to the request", "", "Worst quality of cup even they are not pack it properly when I received cups are floting on coffee lake 😩 then after its very hard to remove packing atleast you need cutter to remove cap when I complete mission successfully i saw bloated inside of cup i never ever suggest this place 😡😡😡😡", "the taste was pathetic, packing was poor, cup quality was third class.\nTapari walas 30 rs coffee is more worth it then this dog sh*t.", "Onle one thing I liked is ambience otherwise food is just zero star. Three items I ordered\n\nMexican rice - 0 star\nSizzler china town - 0 star\nPizza - 2 star\n\nWorst worst worst taste", "The taste was the worst for everything that we ordered. The price to quantity ratio is very bad. Everything is extremely over-priced as well as zero taste. There were no kidney beans in Mexican sizzler, all the milkshakes were very watery and the level of food quality is zero. The rice was undercooked with no sense of mexican food taste or quality.\n\nThe manager was extremely rude and did not care about the customer at all. Even after complaining so much, he said and I quote,”one customer is not going to do any bad to us.” The overall attitude was so bad and he did not let me speak and complete my sentences. Was extremely frustrating and asked me to pay the whole bill like it was...read more", "Send missing sandwich or refund money . This is cheating", "", "What", "", "Awesome food... Lovely ambience... Worth place to hangout with family and friends..Must try once ....Open seating place is BEST..", "Well we prefer going to a place that has less crowd on Sunday but with my recent experience at this cafe I would recommend to stand in line for good and hygienic food because ultimately it is worth the wait. Here is my review about this restaurant might help you decide.\n\nWhat’s good?\nSitting & Staff\n\nWhat’s not good?\nEverything except I have mentioned above\n\nP.S. The worst part is some of us got stomach infection on the next day", "Yesterday we went for dinner.food was spicy and unhygienic.service was disgusting. Three of our friends got stomach infection.i would not recommend this restaurant to any one who is searching for nice and hygiene place.", "Great place with a great ambience. It would a great pleasure for me to visit the place back again and hangout!", "It was really a great experience being there! Great ambience, great food. I could surely say that the place is worth it!", "", "Had the worst experience at this coffee culture , I had been at other branches and was expecting good food, I couldn't even finish my food . Staff was way too ignorant, ignored all my questions\nI ordered\nArrabbiata pasta\nIced Cafe latte and couldn't finish both\nPasta was so spicy had no flavor , taste or veggies except olives\nCafe latte was extremely poor in taste it was only ice and no latte.\nIt's extremely overpriced for what they serve.", "", "Sabji was too much salty", "World’s best nachos was indeed one of the best nachos I had till now.. it’s the must try..\nKat shake is bit expensive but worth trying.. loved it…\nAglio olio was ok ok.. not too good not too bAd..\nenchiladas was too cheesy and creamy but tasty..must try..\nAmbience is good.. lots of spots to click Instagrammable pic…", "The place is soo expensive. And we all got food poisoning(infection). Don't go here. It's just waste of money and health.", "Worst packing (coffee cup in plastic bag, without sugar sachet) & bad in taste.", "we ordered a cappuccino, cold coffee and garlic bread and the entire order was either terribly contaminated or severely mishandled.\n\nthe paper bag was soaking wet and dripping with coffee. even the coffee was poorly packed using makeshift aluminium foils and 15 cello tapes.\n\nhowever, not everything was grim and dim - the fact that the more than half of the coffee was spilled all over the place eventually paved way for some sound philosophical discussions where we were debating whether the coffee cup was half-empty or half-full. (the outcome depends on whether you consider yourself an optimist or a pessimist).\n\nso if you lack those kinda discussions in your daily routine, I recommend that...read more", "Loved their great variety of dishes. The taste of food is delicious and had a great touch of mexican food. Their sandwiches are excellent. Highly recommended if you want to spend some special time with food and friends.", "Beautiful interior, food was delicious. Loved eating pizza with cold coffee with perfect sugar. Service was too good. Staff was very cooperative and humble. Perfect place to catch up wid ur friends and colleagues. It's beautiful decor gives a nice romantic look. One must visit here", "Incredible place, lovely ambiance. The staff is extremely polite and the food is absolutely delicious", "The cafe is too good.\nThere is the facility of live streaming also.\nThe food quality is also very very good.\nIt is the best place to visit with friends.", "Absolutely amazing ! The place is beautiful and ambience was super cool. food was super delicious...", "the food quality was amazing, the staff were really kind and hospitable as well. The ambience is beautiful. Everything on the menu has so much variety and it’s delicious. It was my first time over here, and I would definitely recommend to other people. It’s a must visit!", "The food quality is too good. The staff is very good. The best place to visit with friends. The service is just awesome and perfect.", "The place is just perfect for couples, they also provide live streaming facilities.\nStaff and service was so good.\nMust visit this place..", "This restaurant provide good service I really like this restaurant serving system and all other things .\nReally I liked this .", "The ambiance is beautiful and the staff is really hospitable. Much variety in menu is available and everything is delicious!! Highly recommended", "Lovely food, excellent service. Like all of view.\nIt was wonderful gravy items that was enjoy with my friends. My friends were also happy with new taste and quality.", "", "It was a nice experience and I loved the place. It had a great Ambience and the vibe is just perfect. Hope you guys love it too ❤️", "Awesome place to go with friends and colleagues. In Non-Veg, their Chicken Patiala has unique and awesome taste. Cheese Naan is quite a softy. Been there 2 times in a week to again taste the dishes.", "The staff is very good and prices are also moderate, the service is also good and the taste of food is best", "Best place to visit with friends & family . It has good location & with good staff. Test of food was amazing! Try once visit once …", "A very good place to visit with your friends and family. It has good ambience and a nice service. Food is also good. It is worth visiting.", "Great place with a good ambience. The quality of food and taste is amazing.It’s a must try with friends and family. The service is great.", "It’s a great place, with good ambience and service. Also the food quality and taste is also nice. It’s a worth visiting cafe.", "Loved their great variety of dishes. The taste of food is delicious and had a great touch of mexican food. Their sandwiches are excellent. Highly recommended if you want to spend some special time with food and friends.", "Firstly i have had both expiriece of dine in and delivery both , the expirience was fantastic. The food quality is perfect and has a authentic taste to every item . The seating expirience is also too good , the welcoming , staff service is overwhelming. The food dosent get soggy in delivery due to well equiped delivery packages . Must try everyone .", "Have heard a lot about this place and also it is one of the top recommended cafes. It is a must try with friends and family.", "The food at is exceptional! Very tasty and well prepared and you can chose among many menu options. I love the service at the place", "It is the best place to visit with family. The food quality and its service is just awesome. Must visit place", "What a stunning spot\nLovely stylistic layout plentiful feasting territory\nStaff is exceptionally heartfelt .\nComing to food ,\nThey have an exceptionally explained menu and bunches of variety to attempt ..\nShould visit this place without doubt.", "It is the best place to hangout with friends. Food was good. The place is clean and hygenic.\nSurely recommended !!", "Great Ambiance. Food is great Also there is a good variety of coffee. The service is very good. Must visit this place....", "Amazing experience . .The ambience is decent yet aesthetic.Don't miss to visit this place with your friend and family .", "Go to place to hangout. Love everything about the place!! Comfy place, great ambience, amazing staff", "Lovely ambience. It's a nice and lively place where you can take a couple of Instagram-worthy photos. The food is great and their irish cold coffee is a must try. The service is unmatched. The staff truly cares about your experience. Do yourself a favor and visit this lovely cafe in Ahmedabad.", "It is the best place for family dining. Live streaming is also available. Must try Panner Chilli Dry, Popeye Paneer Grill Sandwich", "Best place to hangout with friends and family with a variety of coffees and the ambience of the place make the place peaceful do visit coffee culture", "Amazing Experience\nTasty and Healthy options available\nQuality service\nSuperb ambiance and music\nSurely recommended!", "The food is simply so amazing. Also the service is so good and the ambiance is too good...must visit this place.", "Food is simply amazing and if you eat for taste and for a good food experience then must visit the table and try out amazing food and desserts. Nothing can compare to their positive atmosphere of this place. Just love this place and will surely recommend everyone to do so.", "", "I recently visted here. It is clean and hygienic. The food was amazing and staff were also kind. The most i likes is hot chocolate.", "This cozy restaurant has left the best impressions! Hospitable hosts, delicious dishes, beautiful presentation, wide wine list and wonderful dessert. I recommend to everyone! I would like to come back here again and again.", "Great place nd food staff is good nd there is also live streaming so great entertainment is there place to visit", "Loved the food and the ambience...great place to chill with friends!! arrabbiata pasta was delicious 😋"]}]